<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.10'/>
    <dependency name='libz.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='cityhash4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libshare.c' comp-dir-path='/home/allan/zfsonlinux/lib/libshare' language='LANG_C89'>
    <function-decl name='libshare_nfs_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libshare_smb_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nfs.c' comp-dir-path='/home/allan/zfsonlinux/lib/libshare' language='LANG_C89'>
    <function-decl name='flock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='unlink' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nfs_copy_entries' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-3'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <typedef-decl name='__mode_t' type-id='type-id-8' id='type-id-4'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/nfs.c' comp-dir-path='/home/allan/zfsonlinux/lib/libshare' language='LANG_C89'>
    <typedef-decl name='sa_share_impl_t' type-id='type-id-9' id='type-id-10'/>
    <class-decl name='sa_share_impl' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_mountpoint' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_zfsname' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sa_fsinfo' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_fsinfo_t' type-id='type-id-13' id='type-id-14'/>
    <class-decl name='sa_share_fsinfo' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shareopts' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_fstype_t' type-id='type-id-15' id='type-id-16'/>
    <class-decl name='sa_fstype' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fsinfo_index' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_ops_t' type-id='type-id-19' id='type-id-20'/>
    <class-decl name='sa_share_ops' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enable_share' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disable_share' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_shared' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='validate_shareopts' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update_shareopts' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear_shareopts' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='commit_shares' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-25'/>
    <function-decl name='nfs_toggle_share' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fputs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='register_fstype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-37'/>
    <function-type size-in-bits='64' id='type-id-28'>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-29'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-30'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-31'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-33'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-35'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
    <typedef-decl name='FILE' type-id='type-id-40' id='type-id-38'/>
    <typedef-decl name='boolean_t' type-id='type-id-41' id='type-id-39'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-52' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-41'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-42'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-47'>
      <subrange length='1' type-id='type-id-56' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-52'>
      <subrange length='20' type-id='type-id-56' id='type-id-58'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-46'/>
    <typedef-decl name='__off64_t' type-id='type-id-59' id='type-id-49'/>
    <typedef-decl name='__off_t' type-id='type-id-59' id='type-id-44'/>
    <typedef-decl name='size_t' type-id='type-id-60' id='type-id-51'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-45'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-50'/>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-56'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-1' id='type-id-54'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-60'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/smb.c' comp-dir-path='/home/allan/zfsonlinux/lib/libshare' language='LANG_C89'>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-65'/>
    <function-decl name='opendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='fgets' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-66'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-64'>
      <subrange length='256' type-id='type-id-56' id='type-id-68'/>
    </array-type-def>
    <typedef-decl name='__ino64_t' type-id='type-id-60' id='type-id-62'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-63'/>
    <typedef-decl name='DIR' type-id='type-id-69' id='type-id-67'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/icp/algs/sha2/sha2.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <function-decl name='htonl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <typedef-decl name='uint32_t' type-id='type-id-8' id='type-id-70'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/cityhash.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <function-decl name='cityhash4' mangled-name='cityhash4' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cityhash4'>
      <parameter type-id='type-id-71' name='w1'/>
      <parameter type-id='type-id-71' name='w2'/>
      <parameter type-id='type-id-71' name='w3'/>
      <parameter type-id='type-id-71' name='w4'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <typedef-decl name='uint64_t' type-id='type-id-60' id='type-id-71'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfeature_common.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-72' size-in-bits='15232' id='type-id-73'>
      <subrange length='34' type-id='type-id-56' id='type-id-74'/>
    </array-type-def>
    <typedef-decl name='zfeature_info_t' type-id='type-id-75' id='type-id-72'/>
    <class-decl name='zfeature_info' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_feature' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_uname' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_guid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_desc' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_flags' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fi_zfs_mod_supported' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_type' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_depends' type-id='type-id-79' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfeature_flags_t' type-id='type-id-80' id='type-id-77'/>
    <enum-decl name='zfeature_flags' id='type-id-80'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFEATURE_FLAG_READONLY_COMPAT' value='1'/>
      <enumerator name='ZFEATURE_FLAG_MOS' value='2'/>
      <enumerator name='ZFEATURE_FLAG_ACTIVATE_ON_ENABLE' value='4'/>
      <enumerator name='ZFEATURE_FLAG_PER_DATASET' value='8'/>
    </enum-decl>
    <typedef-decl name='zfeature_type_t' type-id='type-id-81' id='type-id-78'/>
    <enum-decl name='zfeature_type' id='type-id-81'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFEATURE_TYPE_BOOLEAN' value='0'/>
      <enumerator name='ZFEATURE_TYPE_UINT64_ARRAY' value='1'/>
      <enumerator name='ZFEATURE_NUM_TYPES' value='2'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-79'/>
    <function-decl name='zfeature_is_valid_guid' mangled-name='zfeature_is_valid_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_valid_guid'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfeature_depends_on' mangled-name='zfeature_depends_on' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_depends_on'>
      <parameter type-id='type-id-76' name='fid'/>
      <parameter type-id='type-id-76' name='check'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mod_supported'>
      <parameter type-id='type-id-3' name='scope'/>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='spa_feature_table' type-id='type-id-73' mangled-name='spa_feature_table' visibility='default' elf-symbol-id='spa_feature_table'/>
    <var-decl name='zfeature_checks_disable' type-id='type-id-39' mangled-name='zfeature_checks_disable' visibility='default' elf-symbol-id='zfeature_checks_disable'/>
    <typedef-decl name='spa_feature_t' type-id='type-id-83' id='type-id-76'/>
    <enum-decl name='spa_feature' id='type-id-83'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_comutil.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='2624' id='type-id-84'>
      <subrange length='41' type-id='type-id-56' id='type-id-85'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-86'/>
    <function-decl name='zfs_allocatable_devs' mangled-name='zfs_allocatable_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_allocatable_devs'>
      <parameter type-id='type-id-87' name='nv'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_special_devs' mangled-name='zfs_special_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_special_devs'>
      <parameter type-id='type-id-87' name='nv'/>
      <parameter type-id='type-id-5' name='type'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_zpl_version_map' mangled-name='zfs_zpl_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_zpl_version_map'>
      <parameter type-id='type-id-2' name='spa_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_spa_version_map' mangled-name='zfs_spa_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version_map'>
      <parameter type-id='type-id-2' name='zpl_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_dataset_name_hidden' mangled-name='zfs_dataset_name_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_name_hidden'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='zfs_history_event_names' type-id='type-id-84' mangled-name='zfs_history_event_names' visibility='default' elf-symbol-id='zfs_history_event_names'/>
    <function-decl name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-88'/>
    <typedef-decl name='nvlist_t' type-id='type-id-91' id='type-id-89'/>
    <typedef-decl name='nvpair_t' type-id='type-id-92' id='type-id-90'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-95' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-96' id='type-id-95'/>
    <typedef-decl name='int16_t' type-id='type-id-97' id='type-id-94'/>
    <typedef-decl name='int32_t' type-id='type-id-2' id='type-id-93'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-96'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-97'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_deleg.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='4096' id='type-id-99'>
      <subrange length='32' type-id='type-id-56' id='type-id-100'/>
    </array-type-def>
    <typedef-decl name='zfs_deleg_who_type_t' type-id='type-id-101' id='type-id-102'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-101'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_DELEG_WHO_UNKNOWN' value='0'/>
      <enumerator name='ZFS_DELEG_USER' value='117'/>
      <enumerator name='ZFS_DELEG_USER_SETS' value='85'/>
      <enumerator name='ZFS_DELEG_GROUP' value='103'/>
      <enumerator name='ZFS_DELEG_GROUP_SETS' value='71'/>
      <enumerator name='ZFS_DELEG_EVERYONE' value='101'/>
      <enumerator name='ZFS_DELEG_EVERYONE_SETS' value='69'/>
      <enumerator name='ZFS_DELEG_CREATE' value='99'/>
      <enumerator name='ZFS_DELEG_CREATE_SETS' value='67'/>
      <enumerator name='ZFS_DELEG_NAMED_SET' value='115'/>
      <enumerator name='ZFS_DELEG_NAMED_SET_SETS' value='83'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_perm_tab_t' type-id='type-id-103' id='type-id-98'/>
    <class-decl name='zfs_deleg_perm_tab' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_perm' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_note' type-id='type-id-104' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_deleg_note_t' type-id='type-id-105' id='type-id-104'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-105'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_DELEG_NOTE_CREATE' value='0'/>
      <enumerator name='ZFS_DELEG_NOTE_DESTROY' value='1'/>
      <enumerator name='ZFS_DELEG_NOTE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_DELEG_NOTE_ROLLBACK' value='3'/>
      <enumerator name='ZFS_DELEG_NOTE_CLONE' value='4'/>
      <enumerator name='ZFS_DELEG_NOTE_PROMOTE' value='5'/>
      <enumerator name='ZFS_DELEG_NOTE_RENAME' value='6'/>
      <enumerator name='ZFS_DELEG_NOTE_SEND' value='7'/>
      <enumerator name='ZFS_DELEG_NOTE_RECEIVE' value='8'/>
      <enumerator name='ZFS_DELEG_NOTE_ALLOW' value='9'/>
      <enumerator name='ZFS_DELEG_NOTE_USERPROP' value='10'/>
      <enumerator name='ZFS_DELEG_NOTE_MOUNT' value='11'/>
      <enumerator name='ZFS_DELEG_NOTE_SHARE' value='12'/>
      <enumerator name='ZFS_DELEG_NOTE_USERQUOTA' value='13'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPQUOTA' value='14'/>
      <enumerator name='ZFS_DELEG_NOTE_USERUSED' value='15'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPUSED' value='16'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJQUOTA' value='17'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJQUOTA' value='18'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJUSED' value='19'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJUSED' value='20'/>
      <enumerator name='ZFS_DELEG_NOTE_HOLD' value='21'/>
      <enumerator name='ZFS_DELEG_NOTE_RELEASE' value='22'/>
      <enumerator name='ZFS_DELEG_NOTE_DIFF' value='23'/>
      <enumerator name='ZFS_DELEG_NOTE_BOOKMARK' value='24'/>
      <enumerator name='ZFS_DELEG_NOTE_LOAD_KEY' value='25'/>
      <enumerator name='ZFS_DELEG_NOTE_CHANGE_KEY' value='26'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTUSED' value='27'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTQUOTA' value='28'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJUSED' value='29'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJQUOTA' value='30'/>
      <enumerator name='ZFS_DELEG_NOTE_NONE' value='31'/>
    </enum-decl>
    <function-decl name='zfs_deleg_canonicalize_perm' mangled-name='zfs_deleg_canonicalize_perm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_canonicalize_perm'>
      <parameter type-id='type-id-3' name='perm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_deleg_verify_nvlist' mangled-name='zfs_deleg_verify_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_verify_nvlist'>
      <parameter type-id='type-id-87' name='nvp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_deleg_whokey' mangled-name='zfs_deleg_whokey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_whokey'>
      <parameter type-id='type-id-5' name='attr'/>
      <parameter type-id='type-id-102' name='type'/>
      <parameter type-id='type-id-6' name='inheritchr'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <var-decl name='zfs_deleg_perm_tab' type-id='type-id-99' mangled-name='zfs_deleg_perm_tab' visibility='default' elf-symbol-id='zfs_deleg_perm_tab'/>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_delegatable'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='permset_namecheck'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-107'/>
    <typedef-decl name='zfs_prop_t' type-id='type-id-109' id='type-id-106'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-109'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='namecheck_err_t' type-id='type-id-110' id='type-id-108'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-110'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='512' id='type-id-111'>
      <subrange length='8' type-id='type-id-56' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-113' size-in-bits='2048' id='type-id-114'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-116' size-in-bits='1024' id='type-id-117'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-118' size-in-bits='512' id='type-id-119'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-120' size-in-bits='1024' id='type-id-121'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <typedef-decl name='zio_abd_checksum_func_t' type-id='type-id-122' id='type-id-123'/>
    <class-decl name='zio_abd_checksum_func' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acf_init' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acf_fini' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acf_iter' type-id='type-id-127' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_init_t' type-id='type-id-128' id='type-id-129'/>
    <typedef-decl name='zio_abd_checksum_data_t' type-id='type-id-130' id='type-id-131'/>
    <class-decl name='zio_abd_checksum_data' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acd_byteorder' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acd_ctx' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acd_zcp' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acd_private' type-id='type-id-50' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_byteorder_t' type-id='type-id-135' id='type-id-132'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-135'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZIO_CHECKSUM_NATIVE' value='0'/>
      <enumerator name='ZIO_CHECKSUM_BYTESWAP' value='1'/>
    </enum-decl>
    <typedef-decl name='fletcher_4_ctx_t' type-id='type-id-136' id='type-id-137'/>
    <union-decl name='fletcher_4_ctx' size-in-bits='2048' visibility='default' id='type-id-136'>
      <data-member access='private'>
        <var-decl name='scalar' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='superscalar' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sse' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx512' type-id='type-id-114' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='zfs_fletcher_superscalar_t' type-id='type-id-139' id='type-id-120'/>
    <class-decl name='zfs_fletcher_superscalar' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_sse_t' type-id='type-id-141' id='type-id-118'/>
    <class-decl name='zfs_fletcher_sse' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-142' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx_t' type-id='type-id-143' id='type-id-116'/>
    <class-decl name='zfs_fletcher_avx' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx512_t' type-id='type-id-144' id='type-id-113'/>
    <class-decl name='zfs_fletcher_avx512' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-111' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_fini_t' type-id='type-id-128' id='type-id-145'/>
    <typedef-decl name='zio_abd_checksum_iter_t' type-id='type-id-146' id='type-id-147'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-122'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <qualified-type-def type-id='type-id-70' volatile='yes' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-127'/>
    <function-decl name='fletcher_init' mangled-name='fletcher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_init'>
      <parameter type-id='type-id-134' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_native' mangled-name='fletcher_2_incremental_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_native'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-51' name='size'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_2_native' mangled-name='fletcher_2_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_native'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-71' name='size'/>
      <parameter type-id='type-id-50' name='ctx_template'/>
      <parameter type-id='type-id-134' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_byteswap' mangled-name='fletcher_2_incremental_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_byteswap'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-51' name='size'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_2_byteswap' mangled-name='fletcher_2_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_byteswap'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-71' name='size'/>
      <parameter type-id='type-id-50' name='ctx_template'/>
      <parameter type-id='type-id-134' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_4_impl_set' mangled-name='fletcher_4_impl_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_impl_set'>
      <parameter type-id='type-id-3' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_4_native' mangled-name='fletcher_4_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-71' name='size'/>
      <parameter type-id='type-id-50' name='ctx_template'/>
      <parameter type-id='type-id-134' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_4_byteswap' mangled-name='fletcher_4_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_byteswap'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-71' name='size'/>
      <parameter type-id='type-id-50' name='ctx_template'/>
      <parameter type-id='type-id-134' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <var-decl name='fletcher_4_abd_ops' type-id='type-id-123' mangled-name='fletcher_4_abd_ops' visibility='default' elf-symbol-id='fletcher_4_abd_ops'/>
    <function-decl name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='membar_producer' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-146'>
      <parameter type-id='type-id-50' name='buf'/>
      <parameter type-id='type-id-51' name='size'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-1'/>
    </function-type>
    <typedef-decl name='zio_cksum_t' type-id='type-id-151' id='type-id-138'/>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='128' id='type-id-142'>
      <subrange length='2' type-id='type-id-56' id='type-id-152'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='256' id='type-id-140'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-134'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_avx512.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <typedef-decl name='fletcher_4_ops_t' type-id='type-id-153' id='type-id-154'/>
    <class-decl name='fletcher_4_func' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init_native' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_native' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compute_native' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_byteswap' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fini_byteswap' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compute_byteswap' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='valid' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fletcher_4_init_f' type-id='type-id-159' id='type-id-155'/>
    <typedef-decl name='fletcher_4_fini_f' type-id='type-id-160' id='type-id-156'/>
    <typedef-decl name='fletcher_4_compute_f' type-id='type-id-161' id='type-id-157'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-160'/>
    <var-decl name='fletcher_4_avx512f_ops' type-id='type-id-162' mangled-name='fletcher_4_avx512f_ops' visibility='default' elf-symbol-id='fletcher_4_avx512f_ops'/>
    <var-decl name='fletcher_4_avx512bw_ops' type-id='type-id-162' mangled-name='fletcher_4_avx512bw_ops' visibility='default' elf-symbol-id='fletcher_4_avx512bw_ops'/>
    <function-type size-in-bits='64' id='type-id-163'>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_intel.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <var-decl name='fletcher_4_avx2_ops' type-id='type-id-162' mangled-name='fletcher_4_avx2_ops' visibility='default' elf-symbol-id='fletcher_4_avx2_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_sse.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <var-decl name='fletcher_4_sse2_ops' type-id='type-id-162' mangled-name='fletcher_4_sse2_ops' visibility='default' elf-symbol-id='fletcher_4_sse2_ops'/>
    <var-decl name='fletcher_4_ssse3_ops' type-id='type-id-162' mangled-name='fletcher_4_ssse3_ops' visibility='default' elf-symbol-id='fletcher_4_ssse3_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <var-decl name='fletcher_4_superscalar_ops' type-id='type-id-162' mangled-name='fletcher_4_superscalar_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar4.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <var-decl name='fletcher_4_superscalar4_ops' type-id='type-id-162' mangled-name='fletcher_4_superscalar4_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar4_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_namecheck.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <function-decl name='get_dataset_depth' mangled-name='get_dataset_depth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_dataset_depth'>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_component_namecheck' mangled-name='zfs_component_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_component_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-107' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dataset_namecheck' mangled-name='dataset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-107' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='bookmark_namecheck' mangled-name='bookmark_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bookmark_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-107' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='snapshot_namecheck' mangled-name='snapshot_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snapshot_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-107' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <var-decl name='zfs_max_dataset_nesting' type-id='type-id-2' mangled-name='zfs_max_dataset_nesting' visibility='default' elf-symbol-id='zfs_max_dataset_nesting'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_prop.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='768' id='type-id-167'>
      <subrange length='12' type-id='type-id-56' id='type-id-168'/>
    </array-type-def>
    <function-decl name='zfs_prop_string_to_index' mangled-name='zfs_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_string_to_index'>
      <parameter type-id='type-id-106' name='prop'/>
      <parameter type-id='type-id-3' name='string'/>
      <parameter type-id='type-id-169' name='index'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_random_value' mangled-name='zfs_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_random_value'>
      <parameter type-id='type-id-106' name='prop'/>
      <parameter type-id='type-id-71' name='seed'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='zfs_prop_visible' mangled-name='zfs_prop_visible' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_visible'>
      <parameter type-id='type-id-106' name='prop'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_values' mangled-name='zfs_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_values'>
      <parameter type-id='type-id-106' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_is_string' mangled-name='zfs_prop_is_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_is_string'>
      <parameter type-id='type-id-106' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_column_name' mangled-name='zfs_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_column_name'>
      <parameter type-id='type-id-106' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_align_right' mangled-name='zfs_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_align_right'>
      <parameter type-id='type-id-106' name='prop'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='zfs_userquota_prop_prefixes' type-id='type-id-167' mangled-name='zfs_userquota_prop_prefixes' visibility='default' elf-symbol-id='zfs_userquota_prop_prefixes'/>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_index'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_string'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_number'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_hidden'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_impl'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_index_to_string'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_random_value'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-176' id='type-id-174'/>
    <typedef-decl name='zprop_attr_t' type-id='type-id-177' id='type-id-170'/>
    <typedef-decl name='zprop_type_t' type-id='type-id-178' id='type-id-172'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-175'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-176'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-177'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='PROP_DEFAULT' value='0'/>
      <enumerator name='PROP_READONLY' value='1'/>
      <enumerator name='PROP_INHERIT' value='2'/>
      <enumerator name='PROP_ONETIME' value='3'/>
      <enumerator name='PROP_ONETIME_DEFAULT' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-178'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <typedef-decl name='zprop_index_t' type-id='type-id-180' id='type-id-179'/>
    <class-decl name='zfs_index' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pi_name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pi_value' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zpool_prop.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <function-decl name='zpool_prop_string_to_index' mangled-name='zpool_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_string_to_index'>
      <parameter type-id='type-id-181' name='prop'/>
      <parameter type-id='type-id-3' name='string'/>
      <parameter type-id='type-id-169' name='index'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_random_value' mangled-name='zpool_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_random_value'>
      <parameter type-id='type-id-181' name='prop'/>
      <parameter type-id='type-id-71' name='seed'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='zpool_prop_values' mangled-name='zpool_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_values'>
      <parameter type-id='type-id-181' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_prop_column_name' mangled-name='zpool_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_column_name'>
      <parameter type-id='type-id-181' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_prop_align_right' mangled-name='zpool_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_align_right'>
      <parameter type-id='type-id-181' name='prop'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-182' id='type-id-181'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-182'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zprop_common.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <function-decl name='__ctype_tolower_loc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-183'/>
    </function-decl>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-184'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-185'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' id='type-id-186'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-187' size-in-bits='128' id='type-id-188'>
      <subrange length='2' type-id='type-id-56' id='type-id-152'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8192' id='type-id-189'>
      <subrange length='1024' type-id='type-id-56' id='type-id-190'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-64'>
      <subrange length='256' type-id='type-id-56' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='320' id='type-id-191'>
      <subrange length='40' type-id='type-id-56' id='type-id-192'/>
    </array-type-def>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-193'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-194'/>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-195'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-196'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-97'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-56'/>
    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='192' id='type-id-198'>
      <subrange length='3' type-id='type-id-56' id='type-id-199'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-53'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-63'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-60'/>
    <type-decl name='void' id='type-id-1'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-200' id='type-id-201'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-205' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='18240' is-struct='yes' visibility='default' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-189' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-189' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17504'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_urire' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='libfetch' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='libfetch_load_error' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-213' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-206' id='type-id-214'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-212' id='type-id-215'/>
    <typedef-decl name='size_t' type-id='type-id-60' id='type-id-51'/>
    <typedef-decl name='nvlist_t' type-id='type-id-91' id='type-id-89'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-93' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-2' id='type-id-93'/>
    <typedef-decl name='uint32_t' type-id='type-id-8' id='type-id-70'/>
    <typedef-decl name='uint64_t' type-id='type-id-60' id='type-id-71'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-216' id='type-id-213'/>
    <typedef-decl name='longlong_t' type-id='type-id-196' id='type-id-216'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-194' id='type-id-217'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-193' id='type-id-218'/>
    <typedef-decl name='boolean_t' type-id='type-id-41' id='type-id-39'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-41'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-219' id='type-id-209'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-219'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-59' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-221' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-222' id='type-id-221'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-223' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-224' id='type-id-210'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-51' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-197' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-60' id='type-id-197'/>
    <typedef-decl name='ulong_t' type-id='type-id-60' id='type-id-226'/>
    <typedef-decl name='regex_t' type-id='type-id-228' id='type-id-211'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-230' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='reg_syntax_t' type-id='type-id-60' id='type-id-230'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-176' id='type-id-174'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-176'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-231' id='type-id-204'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-234' id='type-id-232'/>
    <enum-decl name='dmu_objset_type' id='type-id-234'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='uint8_t' type-id='type-id-63' id='type-id-233'/>
    <typedef-decl name='zfs_prop_t' type-id='type-id-109' id='type-id-106'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-109'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-235' id='type-id-236'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-235'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <typedef-decl name='zoneid_t' type-id='type-id-2' id='type-id-237'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-238' id='type-id-239'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-198' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-197' id='type-id-240'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-241' id='type-id-242'/>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-195' id='type-id-243'/>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-244' id='type-id-245'/>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-244'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-246' id='type-id-247'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-248'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-3'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-259'/>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_handle'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='zfs_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='getzoneid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_last' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-255'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_nfs_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_smb_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='remove_mountpoint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strlcat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-256'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-207'/>
    </function-decl>
    <function-decl name='uu_avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-208'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-246'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='32768' id='type-id-260'>
      <subrange length='4096' type-id='type-id-56' id='type-id-261'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='65536' id='type-id-262'>
      <subrange length='8192' type-id='type-id-56' id='type-id-263'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='128' id='type-id-142'>
      <subrange length='2' type-id='type-id-56' id='type-id-152'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-233' size-in-bits='24' id='type-id-264'>
      <subrange length='3' type-id='type-id-56' id='type-id-199'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='type-id-265'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-266' id='type-id-267'/>
    <typedef-decl name='nvpair_t' type-id='type-id-92' id='type-id-90'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-95' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-97' id='type-id-94'/>
    <typedef-decl name='data_type_t' type-id='type-id-96' id='type-id-95'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-96'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-268' id='type-id-269'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-270' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-271' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-274' id='type-id-270'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-275' id='type-id-272'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-276' id='type-id-273'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-142' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-284'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-203' name='zhp'/>
      <parameter type-id='type-id-280' name='oldconfig'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-203' name='zhp'/>
      <parameter type-id='type-id-277' name='missing'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-203' name='zhp'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-3' name='poolname'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-267' name='func'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-242' name='func'/>
      <parameter type-id='type-id-50' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='no_memory' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='uu_avl_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_open_silent' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='make_dataset_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-278'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='256' id='type-id-286'>
      <subrange length='32' type-id='type-id-56' id='type-id-100'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-47'>
      <subrange length='1' type-id='type-id-56' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-52'>
      <subrange length='20' type-id='type-id-56' id='type-id-58'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='896' id='type-id-287'>
      <subrange length='28' type-id='type-id-56' id='type-id-288'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-46'/>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='1024' id='type-id-289'>
      <subrange length='16' type-id='type-id-56' id='type-id-290'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-45'/>
    <typedef-decl name='uint_t' type-id='type-id-8' id='type-id-291'/>
    <typedef-decl name='__ssize_t' type-id='type-id-59' id='type-id-292'/>
    <typedef-decl name='FILE' type-id='type-id-40' id='type-id-38'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-52' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-59' id='type-id-44'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-1' id='type-id-54'/>
    <typedef-decl name='__off64_t' type-id='type-id-59' id='type-id-49'/>
    <typedef-decl name='sigset_t' type-id='type-id-293' id='type-id-294'/>
    <typedef-decl name='__sigset_t' type-id='type-id-295' id='type-id-293'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-293' visibility='default' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-289' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sigaction' size-in-bits='1216' is-struct='yes' visibility='default' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__sigaction_handler' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_mask' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sa_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sa_restorer' type-id='type-id-298' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-297'>
      <data-member access='private'>
        <var-decl name='sa_handler' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sa_sigaction' type-id='type-id-300' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sighandler_t' type-id='type-id-301' id='type-id-299'/>
    <typedef-decl name='siginfo_t' type-id='type-id-302' id='type-id-303'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-303' visibility='default' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_signo' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_errno' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_code' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sifields' type-id='type-id-304' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='896' is-anonymous='yes' visibility='default' id='type-id-304'>
      <data-member access='private'>
        <var-decl name='_pad' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_kill' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_timer' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_rt' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigchld' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigfault' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigpoll' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigsys' type-id='type-id-311' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='type-id-2' id='type-id-312'/>
    <typedef-decl name='__uid_t' type-id='type-id-8' id='type-id-313'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_tid' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_overrun' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-314' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sigval_t' type-id='type-id-315' id='type-id-314'/>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='type-id-315'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-50' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-314' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-308'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_status' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='si_utime' type-id='type-id-316' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='si_stime' type-id='type-id-316' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sigchld_clock_t' type-id='type-id-317' id='type-id-316'/>
    <typedef-decl name='__clock_t' type-id='type-id-59' id='type-id-317'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_addr' type-id='type-id-50' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_band' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_fd' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_call_addr' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_syscall' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_arch' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-320' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tcflag_t' type-id='type-id-8' id='type-id-319'/>
    <typedef-decl name='cc_t' type-id='type-id-63' id='type-id-285'/>
    <typedef-decl name='speed_t' type-id='type-id-8' id='type-id-320'/>
    <typedef-decl name='zpool_prop_t' type-id='type-id-182' id='type-id-181'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-182'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <typedef-decl name='regmatch_t' type-id='type-id-321' id='type-id-322'/>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-322' visibility='default' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-323' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-2' id='type-id-323'/>
    <typedef-decl name='ssize_t' type-id='type-id-292' id='type-id-324'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-327'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-333'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-300'/>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-277' name='is_encroot'/>
      <parameter type-id='type-id-5' name='buf'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='parent_name'/>
      <parameter type-id='type-id-87' name='props'/>
      <parameter type-id='type-id-87' name='pool_props'/>
      <parameter type-id='type-id-39' name='stdin_available'/>
      <parameter type-id='type-id-342' name='wkeydata_out'/>
      <parameter type-id='type-id-343' name='wkeylen_out'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-257' name='origin_zhp'/>
      <parameter type-id='type-id-5' name='parent_name'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-39' name='noop'/>
      <parameter type-id='type-id-5' name='alt_keylocation'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='fsname'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-87' name='raw_props'/>
      <parameter type-id='type-id-39' name='inheritkey'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_to_name'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_error_aux' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__getdelim' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-292'/>
    </function-decl>
    <function-decl name='sigemptyset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-339'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sigaction' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-337'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='printf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fflush' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='tcgetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-341'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='tcsetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getpid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-312'/>
    </function-decl>
    <function-decl name='kill' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-335'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sscanf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-229'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='bcopy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='isatty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='snprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_load_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_to_prop'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_change_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-344'>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-345'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-346'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-338'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='32' id='type-id-347'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <class-decl name='prop_changelist' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-348'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-350' id='type-id-351'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_list_t' type-id='type-id-352' id='type-id-353'/>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-354' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-39' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-355' id='type-id-356'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-355'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-357' id='type-id-358'/>
    <typedef-decl name='uid_t' type-id='type-id-313' id='type-id-359'/>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-360' id='type-id-361'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-360'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='int64_t' type-id='type-id-59' id='type-id-362'/>
    <typedef-decl name='zprop_type_t' type-id='type-id-178' id='type-id-172'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-178'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__gid_t' type-id='type-id-8' id='type-id-364'/>
    <class-decl name='group' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_passwd' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gr_gid' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gr_mem' type-id='type-id-248' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='namecheck_err_t' type-id='type-id-110' id='type-id-108'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-110'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-366' id='type-id-367'/>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-366'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-347' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-2' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-197' id='type-id-368'/>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='prop_changelist_t' type-id='type-id-348' id='type-id-370'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-372' id='type-id-373'/>
    <typedef-decl name='__time_t' type-id='type-id-59' id='type-id-372'/>
    <enum-decl name='lzc_dataset_type' id='type-id-374'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-173'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-377'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-379'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-381'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-383'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-389'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-390'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-392'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-395'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-174' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-174' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-202' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-202' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-202' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-39' name='enable'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='fsname'/>
      <parameter type-id='type-id-388' name='entry'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='special'/>
      <parameter type-id='type-id-3' name='mountp'/>
      <parameter type-id='type-id-3' name='mntopts'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-279' name='spa_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-106' name='prop'/>
      <parameter type-id='type-id-248' name='source'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-39' name='received'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-106' name='prop'/>
      <parameter type-id='type-id-169' name='value'/>
      <parameter type-id='type-id-259' name='src'/>
      <parameter type-id='type-id-5' name='statbuf'/>
      <parameter type-id='type-id-51' name='statlen'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-169' name='propvalue'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-2' name='proplen'/>
      <parameter type-id='type-id-39' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-169' name='propvalue'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-2' name='proplen'/>
      <parameter type-id='type-id-39' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-51' name='proplen'/>
      <parameter type-id='type-id-39' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_type' mangled-name='zfs_get_underlying_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_type'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-174' name='types'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-174' name='type'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-39' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-87' name='snaps'/>
      <parameter type-id='type-id-39' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-5' name='snapname'/>
      <parameter type-id='type-id-39' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-87' name='snaps'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-39' name='recursive'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='target'/>
      <parameter type-id='type-id-351' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-396' name='plp'/>
      <parameter type-id='type-id-39' name='received'/>
      <parameter type-id='type-id-39' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-205' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='resource'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='resource'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='oldname'/>
      <parameter type-id='type-id-5' name='newname'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-356' name='type'/>
      <parameter type-id='type-id-358' name='func'/>
      <parameter type-id='type-id-50' name='arg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-2' name='cleanup_fd'/>
      <parameter type-id='type-id-87' name='holds'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='snapname'/>
      <parameter type-id='type-id-3' name='tag'/>
      <parameter type-id='type-id-39' name='recursive'/>
      <parameter type-id='type-id-2' name='cleanup_fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='snapname'/>
      <parameter type-id='type-id-3' name='tag'/>
      <parameter type-id='type-id-39' name='recursive'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-280' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-39' name='un'/>
      <parameter type-id='type-id-87' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-280' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-203' name='zph'/>
      <parameter type-id='type-id-71' name='volsize'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-3' name='propval'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-257' name='snap'/>
      <parameter type-id='type-id-39' name='force'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='target'/>
      <parameter type-id='type-id-87' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-361' name='activity'/>
      <parameter type-id='type-id-277' name='missing'/>
      <parameter type-id='type-id-277' name='waited'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-387'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_type'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='strrchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-60'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_user'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-203'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strtoul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='getpwnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-390'/>
    </function-decl>
    <function-decl name='getgrnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_string'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strstr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='entity_namecheck'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_name_valid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_numnodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <return type-id='type-id-226'/>
    </function-decl>
    <function-decl name='getmntany' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-388'/>
      <parameter type-id='type-id-388'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-375'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='avl_add' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-388'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_numeric'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='hasmntopt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-378'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_for_type'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_readonly'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_setonce'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mountpoint_namecheck'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_parse_options' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-95'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicestrtonum'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_encryption_key_param'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zprop_parse_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_userquota'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_written'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_keylocation'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inheritable'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='changelist_gather' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-391'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='changelist_prefix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='changelist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_postfix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-394'/>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='localtime_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-382'/>
      <parameter type-id='type-id-393'/>
      <return type-id='type-id-393'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-384'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_index_to_string'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_nestcheck'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-203'/>
    </function-decl>
    <function-decl name='lzc_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_all_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='changelist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='lzc_promote' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='changelist_rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_expand_list' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-396'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_hold' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_release' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strerror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_size' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-389'/>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strtol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_clone' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-386'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='448' id='type-id-397'>
      <subrange length='56' type-id='type-id-56' id='type-id-398'/>
    </array-type-def>
    <typedef-decl name='differ_info_t' type-id='type-id-399' id='type-id-400'/>
    <class-decl name='differ_info' size-in-bits='9024' is-struct='yes' visibility='default' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zhp' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fromsnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frommnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tosnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tomnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ds' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dsmnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tmpsnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='errbuf' type-id='type-id-189' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='isclone' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='scripted' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='classify' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='timestamped' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='shares' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='zerr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8928'>
        <var-decl name='cleanupfd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='outputfd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8992'>
        <var-decl name='datafd' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_t' type-id='type-id-60' id='type-id-401'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-402' id='type-id-403'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' id='type-id-402'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-59' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-403' const='yes' id='type-id-404'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-2' name='outfd'/>
      <parameter type-id='type-id-3' name='fromsnap'/>
      <parameter type-id='type-id-3' name='tosnap'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fdopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_validate_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='find_shares_object' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-406'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pipe2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-405'/>
      <parameter type-id='type-id-409'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_join' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-408'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-50'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-410' size-in-bits='192' id='type-id-411'>
      <subrange length='3' type-id='type-id-56' id='type-id-199'/>
    </array-type-def>
    <typedef-decl name='pool_state_t' type-id='type-id-412' id='type-id-413'/>
    <enum-decl name='pool_state' id='type-id-412'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-414' id='type-id-415'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-417' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-418' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-419' id='type-id-420'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-421' id='type-id-422'/>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-424' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-424' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-426' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__unused' type-id='type-id-411' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-60' id='type-id-424'/>
    <typedef-decl name='__ino64_t' type-id='type-id-60' id='type-id-62'/>
    <typedef-decl name='__nlink_t' type-id='type-id-60' id='type-id-425'/>
    <typedef-decl name='__mode_t' type-id='type-id-8' id='type-id-4'/>
    <typedef-decl name='__blksize_t' type-id='type-id-59' id='type-id-426'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-59' id='type-id-427'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-372' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-410' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-59' id='type-id-410'/>
    <qualified-type-def type-id='type-id-416' const='yes' id='type-id-414'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-418'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-430'/>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-2' name='fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-2' name='fd'/>
      <parameter type-id='type-id-429' name='state'/>
      <parameter type-id='type-id-248' name='namestr'/>
      <parameter type-id='type-id-277' name='inuse'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <var-decl name='libzfs_config_ops' type-id='type-id-415' mangled-name='libzfs_config_ops' visibility='default' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zcmd_write_conf_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__fxstat64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-430'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pread64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='pwrite64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='zpool_read_label' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-421'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-419'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-431'/>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-2' name='flags'/>
      <parameter type-id='type-id-242' name='callback'/>
      <parameter type-id='type-id-50' name='data'/>
      <parameter type-id='type-id-71' name='min_txg'/>
      <parameter type-id='type-id-71' name='max_txg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-257' name='fs_zhp'/>
      <parameter type-id='type-id-2' name='flags'/>
      <parameter type-id='type-id-3' name='spec_orig'/>
      <parameter type-id='type-id-242' name='func'/>
      <parameter type-id='type-id-50' name='arg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-376'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-50'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-432' size-in-bits='256' id='type-id-433'>
      <subrange length='4' type-id='type-id-56' id='type-id-115'/>
    </array-type-def>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='tpool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-434'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='64' id='type-id-435'>
      <subrange length='2' type-id='type-id-56' id='type-id-152'/>
    </array-type-def>
    <typedef-decl name='get_all_cb_t' type-id='type-id-436' id='type-id-437'/>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-438' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-51' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-434' id='type-id-439'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-424' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-424' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-426' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__unused' type-id='type-id-411' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino_t' type-id='type-id-60' id='type-id-441'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-59' id='type-id-442'/>
    <typedef-decl name='DIR' type-id='type-id-69' id='type-id-67'/>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='statfs64' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-444'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-433' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fsword_t' type-id='type-id-59' id='type-id-432'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-60' id='type-id-445'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-60' id='type-id-446'/>
    <typedef-decl name='__fsid_t' type-id='type-id-448' id='type-id-447'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-447' visibility='default' id='type-id-448'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-435' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mode_t' type-id='type-id-4' id='type-id-449'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-225' id='type-id-450'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-438'/>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='options'/>
      <parameter type-id='type-id-2' name='flags'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-248' name='where'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-248' name='where'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-3' name='proto'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_shareall' mangled-name='zfs_shareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_shareall'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-257' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-3' name='proto'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-452' name='cbp'/>
      <parameter type-id='type-id-257' name='zhp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_foreach_mountpoint' mangled-name='zfs_foreach_mountpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_foreach_mountpoint'>
      <parameter type-id='type-id-202' name='hdl'/>
      <parameter type-id='type-id-438' name='handles'/>
      <parameter type-id='type-id-51' name='num_handles'/>
      <parameter type-id='type-id-242' name='func'/>
      <parameter type-id='type-id-50' name='data'/>
      <parameter type-id='type-id-39' name='parallel'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_enable_datasets' mangled-name='zpool_enable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_enable_datasets'>
      <parameter type-id='type-id-203' name='zhp'/>
      <parameter type-id='type-id-3' name='mntopts'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_disable_datasets' mangled-name='zpool_disable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_disable_datasets'>
      <parameter type-id='type-id-203' name='zhp'/>
      <parameter type-id='type-id-39' name='force'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='do_unmount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='changelist_unshare' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-456'/>
      <parameter type-id='type-id-458'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fdopendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-451'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='statfs64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-455'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='do_mount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mkdirp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-449'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_disable_share' mangled-name='sa_disable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_disable_share'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_errorstr' mangled-name='sa_errorstr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_errorstr'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sa_is_shared' mangled-name='sa_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_is_shared'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='sa_enable_share' mangled-name='sa_enable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_enable_share'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_validate_shareopts' mangled-name='sa_validate_shareopts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_validate_shareopts'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_commit_shares' mangled-name='sa_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_commit_shares'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rmdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-450'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-453'/>
      <return type-id='type-id-456'/>
    </function-decl>
    <function-decl name='tpool_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-457'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_pool.c' comp-dir-path='/home/allan/zfsonlinux/lib/libzfs' language='LANG_C89'>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-459'/>
    <typedef-decl name='vdev_state_t' type-id='type-id-460' id='type-id-461'/>
    <enum-decl name='vdev_state' id='type-id-460'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='VDEV_STATE_UNKNOWN' value='0'/>
      <enumerator name='VDEV_STATE_CLOSED' value='1'/>
      <enumerator name='VDEV_STATE_OFFLINE' value='2'/>
      <enumerator name='VDEV_STATE_REMOVED' value='3'/>
      <enumerator name='VDEV_STATE_CANT_OPEN' value='4'/>
      <enumerator name='VDEV_STATE_FAULTED' value='5'/>
      <enumerator name='VDEV_STATE_DEGRADED' value='6'/>
      <enumerator name='VDEV_STATE_HEALTHY' value='7'/>
    </enum-decl>
    <typedef-decl name='vdev_aux_t' type-id='type-id-462' id='type-id-463'/>
    <enum-decl name='vdev_aux' id='type-id-462'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='VDEV_AUX_NONE' value='0'/>
      <enumerator name='VDEV_AUX_OPEN_FAILED' value='1'/>
      <enumerator name='VDEV_AUX_CORRUPT_DATA' value='2'/>
      <enumerator name='VDEV_AUX_NO_REPLICAS' value='3'/>
      <enumerator name='VDEV_AUX_BAD_GUID_SUM' value='4'/>
      <enumerator name='VDEV_AUX_TOO_SMALL' value='5'/>
      <enumerator name='VDEV_AUX_BAD_LABEL' value='6'/>
      <enumerator name='VDEV_AUX_VERSION_NEWER' value='7'/>
      <enumerator name='VDEV_AUX_VERSION_OLDER' value='8'/>
      <enumerator name='VDEV_AUX_UNSUP_FEAT' value='9'/>
      <enumerator name='VDEV_AUX_SPARED' value='10'/>
      <enumerator name='VDEV_AUX_ERR_EXCEEDED' value='11'/>
      <enumerator name='VDEV_AUX_IO_FAILURE' value='12'/>
      <enumerator name='VDEV_AUX_BAD_LOG' value='13'/>
      <enumerator name='VDEV_AUX_EXTERNAL' value='14'/>
      <enumerator name='VDEV_AUX_SPLIT_POOL' value='15'/>
      <enumerator name='VDEV_AUX_BAD_ASHIFT' value='16'/>
      <enumerator name='VDEV_AUX_EXTERNAL_PERSIST' value='17'/>
      <enumerator name='VDEV_AUX_ACTIVE' value='18'/>
      <enumerator name='VDEV_AUX_CHILDREN_OFFLINE' value='19'/>
      <enumerator name='VDEV_AUX_ASHIFT_TOO_BIG' value='20'/>
    </enum-decl>
    <typedef-decl name='pool_scan_func_t' type-id='type-id-464' id='type-id-465'/>
    <enum-decl name='pool_scan_func' id='type-id-464'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='POOL_SCAN_NONE' value='0'/>
      <enumerator name='POOL_SCAN_SCRUB' value='1'/>
      <enumerator name='POOL_SCAN_RESILVER' value='2'/>
      <enumerator name='POOL_SCAN_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_scrub_cmd_t' type-id='type-id-466' id='type-id-467'/>
    <enum-decl name='pool_scrub_cmd' id='type-id-466'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='POOL_SCRUB_NORMAL' value='0'/>
      <enumerator name='POOL_SCRUB_PAUSE' value='1'/>
      <enumerator name='POOL_SCRUB_FLAGS_END' value='2'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-468' id='type-id-469'/>
    <enum-decl name='pool_trim_func' id='type-id-468'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='trimflags_t' type-id='type-id-470' id='type-id-471'/>
    <class-decl name='trimflags' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-470'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fullpool' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='secure' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-472' id='type-id-473'/>
    <enum-decl name='pool_initialize_func' id='type-id-472'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-474' id='type-id-475'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-474'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_compat_status_t' type-id='type-id-476' id='type-id-477'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-476'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPOOL_COMPATIBILITY_OK' value='0'/>
      <enumerator name='ZPOOL_COMPATIBILITY_WARNTOKEN' value='1'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADTOKEN' value='2'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADFILE' value='3'/>
      <enumerator name='ZPOOL_COMPATIBILITY_NOFILES' value='4'/>
    </enum-decl>
    <typedef-decl name='splitflags_t' type-id='type-id-478' id='type-id-479'/>
    <class-decl name='splitflags' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-478'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='dryrun' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='import' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spa_feature_t' type-id='type-id-83' id='type-id-76'/>
    <enum-decl name='spa_feature' id='type-id-83'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
    <typedef-decl name='zpool_status_t' type-id='type-id-480' id='type-id-481'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-480'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_CACHE' value='0'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_R' value='1'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_NR' value='2'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_R' value='3'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_NR' value='4'/>
      <enumerator name='ZPOOL_STATUS_BAD_GUID_SUM' value='5'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_POOL' value='6'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_DATA' value='7'/>
      <enumerator name='ZPOOL_STATUS_FAILING_DEV' value='8'/>
      <enumerator name='ZPOOL_STATUS_VERSION_NEWER' value='9'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_MISMATCH' value='10'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_ACTIVE' value='11'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_REQUIRED' value='12'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_WAIT' value='13'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_CONTINUE' value='14'/>
