<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libudev.so.0'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.5'/>
    <dependency name='libcrypto.so.111'/>
    <dependency name='libz.so.6'/>
    <dependency name='libdl.so.1'/>
    <dependency name='libintl.so.8'/>
    <dependency name='libutil.so.9'/>
    <dependency name='libgeom.so.5'/>
    <dependency name='libthr.so.3'/>
    <dependency name='libc.so.7'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='cityhash4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libshare.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libshare' language='LANG_C99'>
    <function-decl name='libshare_nfs_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libshare_smb_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nfs.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libshare' language='LANG_C99'>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='mkostemp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='flock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nfs_copy_entries' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='unlink' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-2'/>
    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/nfs.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libshare' language='LANG_C99'>
    <class-decl name='pidfh' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-8'/>
    <class-decl name='sa_fstype' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fsinfo_index' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_ops_t' type-id='type-id-12' id='type-id-13'/>
    <class-decl name='sa_share_ops' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enable_share' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disable_share' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_shared' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='validate_shareopts' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update_shareopts' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear_shareopts' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='commit_shares' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_impl_t' type-id='type-id-20' id='type-id-21'/>
    <class-decl name='sa_share_impl' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_mountpoint' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_zfsname' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sa_fsinfo' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_fsinfo_t' type-id='type-id-24' id='type-id-25'/>
    <class-decl name='sa_share_fsinfo' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shareopts' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-18'/>
    <function-decl name='fgets' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='register_fstype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='nfs_toggle_share' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pidfile_open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='pidfile_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-38'/>
    <function-type size-in-bits='64' id='type-id-29'>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-30'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-31'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-33'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-34'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-39'/>
    <class-decl name='__sFILE' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_p' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_r' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_w' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_flags' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='_file' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_bf' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_lbfsize' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_cookie' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_close' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_read' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_seek' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_write' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_ub' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_up' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_ur' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_ubuf' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_nbuf' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_lb' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_blksize' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_fl_mutex' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_fl_owner' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_fl_count' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='_orientation' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_mbstate' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-56' id='type-id-41'/>
    <class-decl name='__sbuf' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_size' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-56'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-53'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-43'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-63' id='type-id-55'/>
    <typedef-decl name='fpos_t' type-id='type-id-64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-42'/>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='8' id='type-id-51'>
      <subrange length='1' type-id='type-id-67' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='24' id='type-id-50'>
      <subrange length='3' type-id='type-id-67' id='type-id-69'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-45'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-67'/>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <typedef-decl name='__off_t' type-id='type-id-70' id='type-id-64'/>
    <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' id='type-id-63'>
      <data-member access='private'>
        <var-decl name='__mbstate8' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_mbstateL' type-id='type-id-70' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-66'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='1024' id='type-id-71'>
      <subrange length='128' type-id='type-id-67' id='type-id-72'/>
    </array-type-def>
    <typedef-decl name='__int64_t' type-id='type-id-73' id='type-id-70'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-73'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/cityhash.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <function-decl name='cityhash4' mangled-name='cityhash4' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cityhash4'>
      <parameter type-id='type-id-74' name='w1'/>
      <parameter type-id='type-id-74' name='w2'/>
      <parameter type-id='type-id-74' name='w3'/>
      <parameter type-id='type-id-74' name='w4'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <typedef-decl name='uint64_t' type-id='type-id-75' id='type-id-74'/>
    <typedef-decl name='__uint64_t' type-id='type-id-76' id='type-id-75'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-76'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfeature_common.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-77' size-in-bits='15232' id='type-id-78'>
      <subrange length='34' type-id='type-id-67' id='type-id-79'/>
    </array-type-def>
    <typedef-decl name='zfeature_info_t' type-id='type-id-80' id='type-id-77'/>
    <class-decl name='zfeature_info' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_feature' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_uname' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_guid' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_desc' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_flags' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fi_zfs_mod_supported' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_type' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_depends' type-id='type-id-84' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spa_feature_t' type-id='type-id-85' id='type-id-81'/>
    <typedef-decl name='zfeature_flags_t' type-id='type-id-86' id='type-id-82'/>
    <enum-decl name='zfeature_flags' id='type-id-86'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFEATURE_FLAG_READONLY_COMPAT' value='1'/>
      <enumerator name='ZFEATURE_FLAG_MOS' value='2'/>
      <enumerator name='ZFEATURE_FLAG_ACTIVATE_ON_ENABLE' value='4'/>
      <enumerator name='ZFEATURE_FLAG_PER_DATASET' value='8'/>
    </enum-decl>
    <typedef-decl name='zfeature_type_t' type-id='type-id-87' id='type-id-83'/>
    <enum-decl name='zfeature_type' id='type-id-87'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFEATURE_TYPE_BOOLEAN' value='0'/>
      <enumerator name='ZFEATURE_TYPE_UINT64_ARRAY' value='1'/>
      <enumerator name='ZFEATURE_NUM_TYPES' value='2'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-84'/>
    <var-decl name='zfeature_checks_disable' type-id='type-id-41' mangled-name='zfeature_checks_disable' visibility='default' elf-symbol-id='zfeature_checks_disable'/>
    <var-decl name='spa_feature_table' type-id='type-id-78' mangled-name='spa_feature_table' visibility='default' elf-symbol-id='spa_feature_table'/>
    <function-decl name='zfeature_is_valid_guid' mangled-name='zfeature_is_valid_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_valid_guid'>
      <parameter type-id='type-id-2' name='name'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfeature_depends_on' mangled-name='zfeature_depends_on' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_depends_on'>
      <parameter type-id='type-id-81' name='fid'/>
      <parameter type-id='type-id-81' name='check'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mod_supported'>
      <parameter type-id='type-id-2' name='scope'/>
      <parameter type-id='type-id-2' name='name'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <enum-decl name='spa_feature' id='type-id-85'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_comutil.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2624' id='type-id-89'>
      <subrange length='41' type-id='type-id-67' id='type-id-90'/>
    </array-type-def>
    <var-decl name='zfs_history_event_names' type-id='type-id-89' mangled-name='zfs_history_event_names' visibility='default' elf-symbol-id='zfs_history_event_names'/>
    <function-decl name='zfs_allocatable_devs' mangled-name='zfs_allocatable_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_allocatable_devs'>
      <parameter type-id='type-id-91' name='nv'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_special_devs' mangled-name='zfs_special_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_special_devs'>
      <parameter type-id='type-id-91' name='nv'/>
      <parameter type-id='type-id-5' name='type'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_zpl_version_map' mangled-name='zfs_zpl_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_zpl_version_map'>
      <parameter type-id='type-id-4' name='spa_version'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_spa_version_map' mangled-name='zfs_spa_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version_map'>
      <parameter type-id='type-id-4' name='zpl_version'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_dataset_name_hidden' mangled-name='zfs_dataset_name_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_name_hidden'>
      <parameter type-id='type-id-2' name='name'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-93'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-99' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-100' id='type-id-94'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-96'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-97' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-102' id='type-id-99'/>
    <typedef-decl name='int16_t' type-id='type-id-103' id='type-id-98'/>
    <typedef-decl name='int32_t' type-id='type-id-104' id='type-id-97'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-102'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='__int16_t' type-id='type-id-43' id='type-id-103'/>
    <typedef-decl name='__int32_t' type-id='type-id-4' id='type-id-104'/>
    <typedef-decl name='uint32_t' type-id='type-id-105' id='type-id-101'/>
    <typedef-decl name='__uint32_t' type-id='type-id-96' id='type-id-105'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_deleg.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-106' size-in-bits='4096' id='type-id-107'>
      <subrange length='32' type-id='type-id-67' id='type-id-108'/>
    </array-type-def>
    <typedef-decl name='zfs_deleg_perm_tab_t' type-id='type-id-109' id='type-id-106'/>
    <class-decl name='zfs_deleg_perm_tab' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_perm' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_note' type-id='type-id-110' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_deleg_note_t' type-id='type-id-111' id='type-id-110'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-111'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_DELEG_NOTE_CREATE' value='0'/>
      <enumerator name='ZFS_DELEG_NOTE_DESTROY' value='1'/>
      <enumerator name='ZFS_DELEG_NOTE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_DELEG_NOTE_ROLLBACK' value='3'/>
      <enumerator name='ZFS_DELEG_NOTE_CLONE' value='4'/>
      <enumerator name='ZFS_DELEG_NOTE_PROMOTE' value='5'/>
      <enumerator name='ZFS_DELEG_NOTE_RENAME' value='6'/>
      <enumerator name='ZFS_DELEG_NOTE_SEND' value='7'/>
      <enumerator name='ZFS_DELEG_NOTE_RECEIVE' value='8'/>
      <enumerator name='ZFS_DELEG_NOTE_ALLOW' value='9'/>
      <enumerator name='ZFS_DELEG_NOTE_USERPROP' value='10'/>
      <enumerator name='ZFS_DELEG_NOTE_MOUNT' value='11'/>
      <enumerator name='ZFS_DELEG_NOTE_SHARE' value='12'/>
      <enumerator name='ZFS_DELEG_NOTE_USERQUOTA' value='13'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPQUOTA' value='14'/>
      <enumerator name='ZFS_DELEG_NOTE_USERUSED' value='15'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPUSED' value='16'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJQUOTA' value='17'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJQUOTA' value='18'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJUSED' value='19'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJUSED' value='20'/>
      <enumerator name='ZFS_DELEG_NOTE_HOLD' value='21'/>
      <enumerator name='ZFS_DELEG_NOTE_RELEASE' value='22'/>
      <enumerator name='ZFS_DELEG_NOTE_DIFF' value='23'/>
      <enumerator name='ZFS_DELEG_NOTE_BOOKMARK' value='24'/>
      <enumerator name='ZFS_DELEG_NOTE_LOAD_KEY' value='25'/>
      <enumerator name='ZFS_DELEG_NOTE_CHANGE_KEY' value='26'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTUSED' value='27'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTQUOTA' value='28'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJUSED' value='29'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJQUOTA' value='30'/>
      <enumerator name='ZFS_DELEG_NOTE_NONE' value='31'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-112'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_who_type_t' type-id='type-id-113' id='type-id-114'/>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-113'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_DELEG_WHO_UNKNOWN' value='0'/>
      <enumerator name='ZFS_DELEG_USER' value='117'/>
      <enumerator name='ZFS_DELEG_USER_SETS' value='85'/>
      <enumerator name='ZFS_DELEG_GROUP' value='103'/>
      <enumerator name='ZFS_DELEG_GROUP_SETS' value='71'/>
      <enumerator name='ZFS_DELEG_EVERYONE' value='101'/>
      <enumerator name='ZFS_DELEG_EVERYONE_SETS' value='69'/>
      <enumerator name='ZFS_DELEG_CREATE' value='99'/>
      <enumerator name='ZFS_DELEG_CREATE_SETS' value='67'/>
      <enumerator name='ZFS_DELEG_NAMED_SET' value='115'/>
      <enumerator name='ZFS_DELEG_NAMED_SET_SETS' value='83'/>
    </enum-decl>
    <var-decl name='zfs_deleg_perm_tab' type-id='type-id-107' mangled-name='zfs_deleg_perm_tab' visibility='default' elf-symbol-id='zfs_deleg_perm_tab'/>
    <function-decl name='zfs_deleg_canonicalize_perm' mangled-name='zfs_deleg_canonicalize_perm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_canonicalize_perm'>
      <parameter type-id='type-id-2' name='perm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_delegatable'>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_deleg_verify_nvlist' mangled-name='zfs_deleg_verify_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_verify_nvlist'>
      <parameter type-id='type-id-91' name='nvp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='permset_namecheck'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_deleg_whokey' mangled-name='zfs_deleg_whokey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_whokey'>
      <parameter type-id='type-id-5' name='attr'/>
      <parameter type-id='type-id-114' name='type'/>
      <parameter type-id='type-id-6' name='inheritchr'/>
      <parameter type-id='type-id-45' name='data'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-117'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-116'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-115'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-118'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='512' id='type-id-119'>
      <subrange length='8' type-id='type-id-67' id='type-id-120'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='2048' id='type-id-122'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='1024' id='type-id-125'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-126' size-in-bits='512' id='type-id-127'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-128' size-in-bits='1024' id='type-id-129'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <typedef-decl name='zio_abd_checksum_func_t' type-id='type-id-130' id='type-id-131'/>
    <class-decl name='zio_abd_checksum_func' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acf_init' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acf_fini' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acf_iter' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_init_t' type-id='type-id-136' id='type-id-137'/>
    <typedef-decl name='zio_abd_checksum_data_t' type-id='type-id-138' id='type-id-139'/>
    <class-decl name='zio_abd_checksum_data' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acd_byteorder' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acd_ctx' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acd_zcp' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acd_private' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_byteorder_t' type-id='type-id-143' id='type-id-140'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-143'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZIO_CHECKSUM_NATIVE' value='0'/>
      <enumerator name='ZIO_CHECKSUM_BYTESWAP' value='1'/>
    </enum-decl>
    <typedef-decl name='fletcher_4_ctx_t' type-id='type-id-144' id='type-id-145'/>
    <union-decl name='fletcher_4_ctx' size-in-bits='2048' visibility='default' id='type-id-144'>
      <data-member access='private'>
        <var-decl name='scalar' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='superscalar' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sse' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx512' type-id='type-id-122' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='zfs_fletcher_superscalar_t' type-id='type-id-147' id='type-id-128'/>
    <class-decl name='zfs_fletcher_superscalar' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-148' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_sse_t' type-id='type-id-149' id='type-id-126'/>
    <class-decl name='zfs_fletcher_sse' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-150' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx_t' type-id='type-id-151' id='type-id-124'/>
    <class-decl name='zfs_fletcher_avx' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-148' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx512_t' type-id='type-id-152' id='type-id-121'/>
    <class-decl name='zfs_fletcher_avx512' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-119' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_fini_t' type-id='type-id-136' id='type-id-153'/>
    <typedef-decl name='zio_abd_checksum_iter_t' type-id='type-id-154' id='type-id-155'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-130'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-96' volatile='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-142'/>
    <var-decl name='fletcher_4_abd_ops' type-id='type-id-131' mangled-name='fletcher_4_abd_ops' visibility='default' elf-symbol-id='fletcher_4_abd_ops'/>
    <function-decl name='fletcher_init' mangled-name='fletcher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_init'>
      <parameter type-id='type-id-142' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_native' mangled-name='fletcher_2_incremental_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_native'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-159' name='size'/>
      <parameter type-id='type-id-45' name='data'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_2_native' mangled-name='fletcher_2_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_native'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-74' name='size'/>
      <parameter type-id='type-id-45' name='ctx_template'/>
      <parameter type-id='type-id-142' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_byteswap' mangled-name='fletcher_2_incremental_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_byteswap'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-159' name='size'/>
      <parameter type-id='type-id-45' name='data'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_2_byteswap' mangled-name='fletcher_2_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_byteswap'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-74' name='size'/>
      <parameter type-id='type-id-45' name='ctx_template'/>
      <parameter type-id='type-id-142' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_4_impl_set' mangled-name='fletcher_4_impl_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_impl_set'>
      <parameter type-id='type-id-2' name='val'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='membar_producer' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_4_native' mangled-name='fletcher_4_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-74' name='size'/>
      <parameter type-id='type-id-45' name='ctx_template'/>
      <parameter type-id='type-id-142' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fletcher_4_byteswap' mangled-name='fletcher_4_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_byteswap'>
      <parameter type-id='type-id-45' name='buf'/>
      <parameter type-id='type-id-74' name='size'/>
      <parameter type-id='type-id-45' name='ctx_template'/>
      <parameter type-id='type-id-142' name='zcp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-154'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-1'/>
    </function-type>
    <typedef-decl name='size_t' type-id='type-id-160' id='type-id-159'/>
    <typedef-decl name='zio_cksum_t' type-id='type-id-161' id='type-id-146'/>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='128' id='type-id-150'>
      <subrange length='2' type-id='type-id-67' id='type-id-162'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='256' id='type-id-148'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-148' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__size_t' type-id='type-id-75' id='type-id-160'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_avx512.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='fletcher_4_ops_t' type-id='type-id-163' id='type-id-164'/>
    <class-decl name='fletcher_4_func' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init_native' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_native' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compute_native' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_byteswap' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fini_byteswap' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compute_byteswap' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='valid' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fletcher_4_init_f' type-id='type-id-169' id='type-id-165'/>
    <typedef-decl name='fletcher_4_fini_f' type-id='type-id-170' id='type-id-166'/>
    <typedef-decl name='fletcher_4_compute_f' type-id='type-id-171' id='type-id-167'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-172'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-170'/>
    <var-decl name='fletcher_4_avx512f_ops' type-id='type-id-172' mangled-name='fletcher_4_avx512f_ops' visibility='default' elf-symbol-id='fletcher_4_avx512f_ops'/>
    <var-decl name='fletcher_4_avx512bw_ops' type-id='type-id-172' mangled-name='fletcher_4_avx512bw_ops' visibility='default' elf-symbol-id='fletcher_4_avx512bw_ops'/>
    <function-type size-in-bits='64' id='type-id-173'>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_intel.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_avx2_ops' type-id='type-id-172' mangled-name='fletcher_4_avx2_ops' visibility='default' elf-symbol-id='fletcher_4_avx2_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_sse.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_sse2_ops' type-id='type-id-172' mangled-name='fletcher_4_sse2_ops' visibility='default' elf-symbol-id='fletcher_4_sse2_ops'/>
    <var-decl name='fletcher_4_ssse3_ops' type-id='type-id-172' mangled-name='fletcher_4_ssse3_ops' visibility='default' elf-symbol-id='fletcher_4_ssse3_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar_ops' type-id='type-id-172' mangled-name='fletcher_4_superscalar_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar4.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar4_ops' type-id='type-id-172' mangled-name='fletcher_4_superscalar4_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar4_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_namecheck.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='namecheck_err_t' type-id='type-id-118' id='type-id-177'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <var-decl name='zfs_max_dataset_nesting' type-id='type-id-4' mangled-name='zfs_max_dataset_nesting' visibility='default' elf-symbol-id='zfs_max_dataset_nesting'/>
    <function-decl name='get_dataset_depth' mangled-name='get_dataset_depth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_dataset_depth'>
      <parameter type-id='type-id-2' name='path'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_component_namecheck' mangled-name='zfs_component_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_component_namecheck'>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-178' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dataset_namecheck' mangled-name='dataset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_namecheck'>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-178' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='bookmark_namecheck' mangled-name='bookmark_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bookmark_namecheck'>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-178' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='snapshot_namecheck' mangled-name='snapshot_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snapshot_namecheck'>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-178' name='why'/>
      <parameter type-id='type-id-5' name='what'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_prop.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='768' id='type-id-179'>
      <subrange length='12' type-id='type-id-67' id='type-id-180'/>
    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-181'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROP_DEFAULT' value='0'/>
      <enumerator name='PROP_READONLY' value='1'/>
      <enumerator name='PROP_INHERIT' value='2'/>
      <enumerator name='PROP_ONETIME' value='3'/>
      <enumerator name='PROP_ONETIME_DEFAULT' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-182'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-183'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <var-decl name='zfs_userquota_prop_prefixes' type-id='type-id-179' mangled-name='zfs_userquota_prop_prefixes' visibility='default' elf-symbol-id='zfs_userquota_prop_prefixes'/>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_index'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_string'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_number'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_hidden'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_impl'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_string_to_index' mangled-name='zfs_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_string_to_index'>
      <parameter type-id='type-id-187' name='prop'/>
      <parameter type-id='type-id-2' name='string'/>
      <parameter type-id='type-id-188' name='index'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_index_to_string'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_random_value' mangled-name='zfs_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_random_value'>
      <parameter type-id='type-id-187' name='prop'/>
      <parameter type-id='type-id-74' name='seed'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_random_value'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='zfs_prop_visible' mangled-name='zfs_prop_visible' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_visible'>
      <parameter type-id='type-id-187' name='prop'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_prop_values' mangled-name='zfs_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_values'>
      <parameter type-id='type-id-187' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_is_string' mangled-name='zfs_prop_is_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_is_string'>
      <parameter type-id='type-id-187' name='prop'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_column_name' mangled-name='zfs_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_column_name'>
      <parameter type-id='type-id-187' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_align_right' mangled-name='zfs_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_align_right'>
      <parameter type-id='type-id-187' name='prop'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <class-decl name='zfs_index' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pi_name' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pi_value' type-id='type-id-74' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-189'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-190'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-191' id='type-id-187'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-188'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-191'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zpool_prop.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zpool_prop_t' type-id='type-id-192' id='type-id-193'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-192'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <function-decl name='zpool_prop_string_to_index' mangled-name='zpool_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_string_to_index'>
      <parameter type-id='type-id-193' name='prop'/>
      <parameter type-id='type-id-2' name='string'/>
      <parameter type-id='type-id-188' name='index'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_prop_random_value' mangled-name='zpool_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_random_value'>
      <parameter type-id='type-id-193' name='prop'/>
      <parameter type-id='type-id-74' name='seed'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='zpool_prop_values' mangled-name='zpool_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_values'>
      <parameter type-id='type-id-193' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_column_name' mangled-name='zpool_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_column_name'>
      <parameter type-id='type-id-193' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_align_right' mangled-name='zpool_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_align_right'>
      <parameter type-id='type-id-193' name='prop'/>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-67'/>
    <array-type-def dimensions='1' type-id='type-id-194' size-in-bits='128' id='type-id-195'>
      <subrange length='2' type-id='type-id-67' id='type-id-162'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8192' id='type-id-196'>
      <subrange length='1024' type-id='type-id-67' id='type-id-197'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-198'>
      <subrange length='256' type-id='type-id-67' id='type-id-199'/>
    </array-type-def>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <class-decl name='re_guts' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-200'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-201'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-202'/>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-203'/>
    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-204'/>
    <array-type-def dimensions='1' type-id='type-id-205' size-in-bits='192' id='type-id-206'>
      <subrange length='3' type-id='type-id-67' id='type-id-69'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-57'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-66'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-96'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-76'/>
    <type-decl name='void' id='type-id-1'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-212' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='17792' is-struct='yes' visibility='default' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17248'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17280'>
        <var-decl name='libzfs_urire' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17600'>
        <var-decl name='libfetch' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17664'>
        <var-decl name='libfetch_load_error' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='libzfs_force_export' type-id='type-id-41' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-220' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-213' id='type-id-221'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-219' id='type-id-222'/>
    <typedef-decl name='size_t' type-id='type-id-160' id='type-id-159'/>
    <typedef-decl name='__size_t' type-id='type-id-75' id='type-id-160'/>
    <typedef-decl name='__uint64_t' type-id='type-id-76' id='type-id-75'/>
    <typedef-decl name='nvlist_t' type-id='type-id-100' id='type-id-94'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-97' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-104' id='type-id-97'/>
    <typedef-decl name='__int32_t' type-id='type-id-4' id='type-id-104'/>
    <typedef-decl name='uint32_t' type-id='type-id-105' id='type-id-101'/>
    <typedef-decl name='__uint32_t' type-id='type-id-96' id='type-id-105'/>
    <typedef-decl name='uint64_t' type-id='type-id-75' id='type-id-74'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-223' id='type-id-220'/>
    <typedef-decl name='longlong_t' type-id='type-id-204' id='type-id-223'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-202' id='type-id-224'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-201' id='type-id-225'/>
    <typedef-decl name='boolean_t' type-id='type-id-56' id='type-id-41'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-56'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-53' id='type-id-216'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-226' id='type-id-217'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-228' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-159' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-205' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-230' id='type-id-205'/>
    <typedef-decl name='__uintptr_t' type-id='type-id-75' id='type-id-230'/>
    <typedef-decl name='ulong_t' type-id='type-id-76' id='type-id-228'/>
    <typedef-decl name='regex_t' type-id='type-id-231' id='type-id-218'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-218' visibility='default' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='re_magic' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='re_nsub' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='re_endp' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='re_g' type-id='type-id-232' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-233' id='type-id-210'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-233'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-234' id='type-id-211'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-198' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-237' id='type-id-235'/>
    <enum-decl name='dmu_objset_type' id='type-id-237'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='uint8_t' type-id='type-id-238' id='type-id-236'/>
    <typedef-decl name='__uint8_t' type-id='type-id-66' id='type-id-238'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-115'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-239'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-240'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-206' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-243'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-244'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-209'/>
    <function-decl name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-256'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='getzoneid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_smb_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_last' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='remove_mountpoint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_nfs_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-255'/>
    </function-decl>
    <function-decl name='uu_avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-253'/>
    </function-decl>
    <function-decl name='zfs_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_handle'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-246'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='16384' id='type-id-258'>
      <subrange length='2048' type-id='type-id-67' id='type-id-259'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-43'/>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='128' id='type-id-150'>
      <subrange length='2' type-id='type-id-67' id='type-id-162'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-236' size-in-bits='24' id='type-id-260'>
      <subrange length='3' type-id='type-id-67' id='type-id-69'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='type-id-261'/>
    <class-decl name='zfs_cmd' size-in-bits='36224' is-struct='yes' visibility='default' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='zc_nvlist_src' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='zc_pad2' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='zc_history' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='zc_value' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='zc_string' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27008'>
        <var-decl name='zc_guid' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27072'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27136'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27200'>
        <var-decl name='zc_cookie' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27264'>
        <var-decl name='zc_objset_type' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27328'>
        <var-decl name='zc_perm_action' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27392'>
        <var-decl name='zc_history_len' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='zc_history_offset' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='zc_obj' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='zc_iflags' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='zc_share' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='zc_objset_stats' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30208'>
        <var-decl name='zc_begin_record' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32640'>
        <var-decl name='zc_inject_record' type-id='type-id-265' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35456'>
        <var-decl name='zc_defer_destroy' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35488'>
        <var-decl name='zc_flags' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35520'>
        <var-decl name='zc_action_handle' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35584'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35616'>
        <var-decl name='zc_simple' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35624'>
        <var-decl name='zc_pad' type-id='type-id-260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35648'>
        <var-decl name='zc_sendobj' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35712'>
        <var-decl name='zc_fromobj' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35776'>
        <var-decl name='zc_createtxg' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35840'>
        <var-decl name='zc_stat' type-id='type-id-266' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36160'>
        <var-decl name='zc_zoneid' type-id='type-id-74' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-267' id='type-id-263'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-198' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-268' id='type-id-265'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-101' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-269' id='type-id-266'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-150' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zpool_iter_f' type-id='type-id-270' id='type-id-271'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-99' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-103' id='type-id-98'/>
    <typedef-decl name='__int16_t' type-id='type-id-43' id='type-id-103'/>
    <typedef-decl name='data_type_t' type-id='type-id-102' id='type-id-99'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-102'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='zfs_iter_f' type-id='type-id-272' id='type-id-273'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-207' id='type-id-274'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-2' name='poolname'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-209' name='zhp'/>
      <parameter type-id='type-id-280' name='oldconfig'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-209' name='zhp'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='nvlist_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-209' name='zhp'/>
      <parameter type-id='type-id-275' name='missing'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-271' name='func'/>
      <parameter type-id='type-id-45' name='data'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='uu_avl_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zpool_open_silent' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='no_memory' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-273' name='func'/>
      <parameter type-id='type-id-45' name='data'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='make_dataset_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-276'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-105' size-in-bits='128' id='type-id-286'>
      <subrange length='4' type-id='type-id-67' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-287' size-in-bits='160' id='type-id-288'>
      <subrange length='20' type-id='type-id-67' id='type-id-289'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='1024' id='type-id-71'>
      <subrange length='128' type-id='type-id-67' id='type-id-72'/>
    </array-type-def>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='224' id='type-id-290'>
      <subrange length='7' type-id='type-id-67' id='type-id-291'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-73'/>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='8' id='type-id-51'>
      <subrange length='1' type-id='type-id-67' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='24' id='type-id-50'>
      <subrange length='3' type-id='type-id-67' id='type-id-69'/>
    </array-type-def>
    <typedef-decl name='uint_t' type-id='type-id-96' id='type-id-292'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-293'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-294'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-295'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-296'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rm_eo' type-id='type-id-298' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-64' id='type-id-298'/>
    <typedef-decl name='__off_t' type-id='type-id-70' id='type-id-64'/>
    <typedef-decl name='__int64_t' type-id='type-id-73' id='type-id-70'/>
    <class-decl name='__sFILE' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_p' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_r' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_w' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_flags' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='_file' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_bf' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_lbfsize' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_cookie' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_close' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_read' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_seek' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_write' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_ub' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_up' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_ur' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_ubuf' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_nbuf' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_lb' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_blksize' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_fl_mutex' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_fl_owner' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_fl_count' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='_orientation' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_mbstate' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__sbuf' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_size' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-64' id='type-id-52'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-63' id='type-id-55'/>
    <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' id='type-id-63'>
      <data-member access='private'>
        <var-decl name='__mbstate8' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_mbstateL' type-id='type-id-70' visibility='default'/>
      </data-member>
    </union-decl>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-299'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <class-decl name='__sigset' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-286' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sigaction' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__sigaction_u' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sa_mask' type-id='type-id-303' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-302'>
      <data-member access='private'>
        <var-decl name='__sa_handler' type-id='type-id-304' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__sa_sigaction' type-id='type-id-305' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__siginfo' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_signo' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_errno' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_code' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='si_pid' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='si_uid' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='si_status' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='si_addr' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='si_value' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_reason' type-id='type-id-310' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='type-id-104' id='type-id-307'/>
    <typedef-decl name='__uid_t' type-id='type-id-105' id='type-id-308'/>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='type-id-309'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sigval_int' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sigval_ptr' type-id='type-id-45' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-310'>
      <data-member access='private'>
        <var-decl name='_fault' type-id='type-id-311' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_timer' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_mesgq' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_poll' type-id='type-id-314' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__spare__' type-id='type-id-315' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_trapno' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_timerid' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_overrun' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_mqd' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_band' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__spare1__' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__spare2__' type-id='type-id-290' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sigset_t' type-id='type-id-316' id='type-id-303'/>
    <typedef-decl name='__sigset_t' type-id='type-id-300' id='type-id-316'/>
    <class-decl name='termios' size-in-bits='352' is-struct='yes' visibility='default' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_cc' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='c_ispeed' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='c_ospeed' type-id='type-id-319' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tcflag_t' type-id='type-id-96' id='type-id-318'/>
    <typedef-decl name='cc_t' type-id='type-id-66' id='type-id-287'/>
    <typedef-decl name='speed_t' type-id='type-id-96' id='type-id-319'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-231' const='yes' id='type-id-323'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-327'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-331'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-305'/>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-275' name='is_encroot'/>
      <parameter type-id='type-id-5' name='buf'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='parent_name'/>
      <parameter type-id='type-id-91' name='props'/>
      <parameter type-id='type-id-91' name='pool_props'/>
      <parameter type-id='type-id-41' name='stdin_available'/>
      <parameter type-id='type-id-333' name='wkeydata_out'/>
      <parameter type-id='type-id-334' name='wkeylen_out'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_to_name'>
      <parameter type-id='type-id-293'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='zfs_error_aux' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-283' name='origin_zhp'/>
      <parameter type-id='type-id-5' name='parent_name'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='fsname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-41' name='noop'/>
      <parameter type-id='type-id-5' name='alt_keylocation'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_load_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-324'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='isatty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-91' name='raw_props'/>
      <parameter type-id='type-id-41' name='inheritkey'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_to_prop'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='lzc_change_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getline' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='sigemptyset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-322'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sigaction' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fflush' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='tcgetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='tcsetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getpid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='kill' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dlopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='dlsym' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='dlerror' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-58'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-59'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-60'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-65'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-335'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-336'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <class-decl name='prop_changelist' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-337'/>
    <class-decl name='pthread_mutex_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-338'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-118'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-116'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-340'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-191'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-341'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__5' is-anonymous='yes' id='type-id-342'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <class-decl name='passwd' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_change' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_class' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_gecos' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pw_dir' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pw_shell' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pw_expire' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pw_fields' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uid_t' type-id='type-id-308' id='type-id-344'/>
    <typedef-decl name='gid_t' type-id='type-id-347' id='type-id-345'/>
    <typedef-decl name='__gid_t' type-id='type-id-105' id='type-id-347'/>
    <typedef-decl name='time_t' type-id='type-id-348' id='type-id-346'/>
    <typedef-decl name='__time_t' type-id='type-id-70' id='type-id-348'/>
    <class-decl name='group' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_passwd' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gr_gid' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gr_mem' type-id='type-id-243' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-191' id='type-id-187'/>
    <enum-decl name='__anonymous_enum__6' is-anonymous='yes' id='type-id-350'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-351'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__7' is-anonymous='yes' id='type-id-352'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__8' is-anonymous='yes' id='type-id-353'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-353' id='type-id-354'/>
    <enum-decl name='lzc_dataset_type' id='type-id-355'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-356' id='type-id-357'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_list_t' type-id='type-id-358' id='type-id-359'/>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-358'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-41' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-361' id='type-id-362'/>
    <enum-decl name='__anonymous_enum__9' is-anonymous='yes' id='type-id-361'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-363' id='type-id-364'/>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-365' id='type-id-366'/>
    <enum-decl name='__anonymous_enum__10' is-anonymous='yes' id='type-id-365'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-189'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-368'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-370'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-372'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-378'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-383'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-390'/>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-210' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='entity_namecheck'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-2' name='name'/>
      <parameter type-id='type-id-210' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_name_valid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-208' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-284'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-2' name='path'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-208' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <parameter type-id='type-id-384'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-227'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-208' name='hdl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-41' name='enable'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='fsname'/>
      <parameter type-id='type-id-377' name='entry'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_numnodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='getmntent' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-377'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='getmntany' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-377'/>
      <parameter type-id='type-id-377'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_add' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='special'/>
      <parameter type-id='type-id-2' name='mountp'/>
      <parameter type-id='type-id-2' name='mntopts'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-39' name='spa_version'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_for_type'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_readonly'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_setonce'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_encryption_key_param'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zprop_parse_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_user'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='nvpair_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_userquota'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicestrtonum'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mountpoint_namecheck'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_keylocation'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_parse_options' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-342'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_written'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpwnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-379'/>
    </function-decl>
    <function-decl name='getgrnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-2' name='propval'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-187' name='prop'/>
      <parameter type-id='type-id-243' name='source'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_numeric'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-209' name='zph'/>
      <parameter type-id='type-id-74' name='volsize'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='changelist_gather' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-380'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='changelist_prefix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='changelist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_postfix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-41' name='received'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inheritable'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-159' name='proplen'/>
      <parameter type-id='type-id-41' name='literal'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_type'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-350'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='localtime_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-369'/>
      <parameter type-id='type-id-385'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-371'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_index_to_string'>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strsep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-376'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_string'>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hasmntopt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-377'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-187' name='prop'/>
      <parameter type-id='type-id-188' name='value'/>
      <parameter type-id='type-id-390' name='src'/>
      <parameter type-id='type-id-5' name='statbuf'/>
      <parameter type-id='type-id-159' name='statlen'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-188' name='propvalue'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-4' name='proplen'/>
      <parameter type-id='type-id-41' name='literal'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-188' name='propvalue'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='propname'/>
      <parameter type-id='type-id-5' name='propbuf'/>
      <parameter type-id='type-id-4' name='proplen'/>
      <parameter type-id='type-id-41' name='literal'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-373' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-373' name='zhp'/>
      <return type-id='type-id-210'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_type' mangled-name='zfs_get_underlying_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_type'>
      <parameter type-id='type-id-373' name='zhp'/>
      <return type-id='type-id-210'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-210' name='types'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-210' name='type'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_all_shares'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_nestcheck'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-284'/>
    </function-decl>
    <function-decl name='lzc_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-355'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='path'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-41' name='defer'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-5' name='snapname'/>
      <parameter type-id='type-id-41' name='defer'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-91' name='snaps'/>
      <parameter type-id='type-id-41' name='defer'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='target'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_clone' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_promote' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-91' name='snaps'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-2' name='path'/>
      <parameter type-id='type-id-41' name='recursive'/>
      <parameter type-id='type-id-91' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-283' name='snap'/>
      <parameter type-id='type-id-41' name='force'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='target'/>
      <parameter type-id='type-id-357' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='changelist_rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-389' name='plp'/>
      <parameter type-id='type-id-41' name='received'/>
      <parameter type-id='type-id-41' name='literal'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_expand_list' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-387'/>
      <parameter type-id='type-id-340'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-212' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-341'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='resource'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-76'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='resource'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-5' name='dataset'/>
      <parameter type-id='type-id-5' name='path'/>
      <parameter type-id='type-id-5' name='oldname'/>
      <parameter type-id='type-id-5' name='newname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-362' name='type'/>
      <parameter type-id='type-id-364' name='func'/>
      <parameter type-id='type-id-45' name='arg'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='snapname'/>
      <parameter type-id='type-id-2' name='tag'/>
      <parameter type-id='type-id-41' name='recursive'/>
      <parameter type-id='type-id-4' name='cleanup_fd'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-4' name='cleanup_fd'/>
      <parameter type-id='type-id-91' name='holds'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_hold' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='snapname'/>
      <parameter type-id='type-id-2' name='tag'/>
      <parameter type-id='type-id-41' name='recursive'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_release' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-280' name='nvl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-41' name='un'/>
      <parameter type-id='type-id-91' name='nvl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_size' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-280' name='nvl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atoi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-378'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-366' name='activity'/>
      <parameter type-id='type-id-275' name='missing'/>
      <parameter type-id='type-id-275' name='waited'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-365'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='changelist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-375'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <class-decl name='pthread_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-391'/>
    <class-decl name='differ_info' size-in-bits='9024' is-struct='yes' visibility='default' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zhp' type-id='type-id-283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fromsnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frommnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tosnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tomnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ds' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dsmnt' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tmpsnap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='errbuf' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='isclone' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='scripted' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='classify' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='timestamped' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='shares' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='zerr' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8928'>
        <var-decl name='cleanupfd' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='outputfd' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8992'>
        <var-decl name='datafd' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-395' const='yes' id='type-id-396'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-397'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-4' name='outfd'/>
      <parameter type-id='type-id-2' name='fromsnap'/>
      <parameter type-id='type-id-2' name='tosnap'/>
      <parameter type-id='type-id-4' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_validate_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='find_shares_object' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-393'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pipe2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-394'/>
      <parameter type-id='type-id-397'/>
      <parameter type-id='type-id-399'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_join' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fdopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-398'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-45'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-75' size-in-bits='640' id='type-id-400'>
      <subrange length='10' type-id='type-id-67' id='type-id-401'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-3'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-402' id='type-id-403'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-406' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-407' id='type-id-408'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-409' id='type-id-410'/>
    <class-decl name='stat' size-in-bits='1792' is-struct='yes' visibility='default' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-412' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-413' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-414' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-415' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='st_padding0' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='st_padding1' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-412' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_atim' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_mtim' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='st_ctim' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='st_birthtim' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='st_size' type-id='type-id-417' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='st_blocks' type-id='type-id-418' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='st_blksize' type-id='type-id-419' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='st_flags' type-id='type-id-420' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='st_gen' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='st_spare' type-id='type-id-400' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dev_t' type-id='type-id-421' id='type-id-412'/>
    <typedef-decl name='__dev_t' type-id='type-id-75' id='type-id-421'/>
    <typedef-decl name='ino_t' type-id='type-id-422' id='type-id-413'/>
    <typedef-decl name='__ino_t' type-id='type-id-75' id='type-id-422'/>
    <typedef-decl name='nlink_t' type-id='type-id-423' id='type-id-414'/>
    <typedef-decl name='__nlink_t' type-id='type-id-75' id='type-id-423'/>
    <typedef-decl name='mode_t' type-id='type-id-424' id='type-id-415'/>
    <typedef-decl name='__mode_t' type-id='type-id-425' id='type-id-424'/>
    <typedef-decl name='__uint16_t' type-id='type-id-3' id='type-id-425'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='off_t' type-id='type-id-64' id='type-id-417'/>
    <typedef-decl name='blkcnt_t' type-id='type-id-426' id='type-id-418'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-70' id='type-id-426'/>
    <typedef-decl name='blksize_t' type-id='type-id-427' id='type-id-419'/>
    <typedef-decl name='__blksize_t' type-id='type-id-104' id='type-id-427'/>
    <typedef-decl name='fflags_t' type-id='type-id-428' id='type-id-420'/>
    <typedef-decl name='__fflags_t' type-id='type-id-105' id='type-id-428'/>
    <typedef-decl name='pool_state_t' type-id='type-id-429' id='type-id-430'/>
    <enum-decl name='pool_state' id='type-id-429'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-402'/>
    <qualified-type-def type-id='type-id-403' const='yes' id='type-id-431'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-432'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-433'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-431' mangled-name='libzfs_config_ops' visibility='default' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zcmd_write_conf_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-4' name='fd'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-433'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='pwrite' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-208' name='hdl'/>
      <parameter type-id='type-id-4' name='fd'/>
      <parameter type-id='type-id-432' name='state'/>
      <parameter type-id='type-id-243' name='namestr'/>
      <parameter type-id='type-id-275' name='inuse'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_read_label' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-409'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-407'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-91'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <function-decl name='make_dataset_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-273' name='callback'/>
      <parameter type-id='type-id-45' name='data'/>
      <parameter type-id='type-id-74' name='min_txg'/>
      <parameter type-id='type-id-74' name='max_txg'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-283' name='fs_zhp'/>
      <parameter type-id='type-id-2' name='spec_orig'/>
      <parameter type-id='type-id-273' name='func'/>
      <parameter type-id='type-id-45' name='arg'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-434'>
      <subrange length='16' type-id='type-id-67' id='type-id-435'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='640' id='type-id-436'>
      <subrange length='80' type-id='type-id-67' id='type-id-437'/>
    </array-type-def>
    <class-decl name='_dirdesc' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-438'/>
    <class-decl name='tpool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-439'/>
    <array-type-def dimensions='1' type-id='type-id-97' size-in-bits='64' id='type-id-440'>
      <subrange length='2' type-id='type-id-67' id='type-id-162'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='640' id='type-id-441'>
      <subrange length='10' type-id='type-id-67' id='type-id-401'/>
    </array-type-def>
    <class-decl name='statfs' size-in-bits='18752' is-struct='yes' visibility='default' id='type-id-442'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_version' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='f_type' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_flags' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_bsize' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_iosize' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_blocks' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_bfree' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_bavail' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_files' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_ffree' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_syncwrites' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_asyncwrites' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_syncreads' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_asyncreads' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_spare' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_namemax' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='f_owner' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_fsid' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='f_charspare' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='f_fstypename' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='f_mntfromname' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='f_mntonname' type-id='type-id-196' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='type-id-70' id='type-id-443'/>
    <typedef-decl name='fsid_t' type-id='type-id-445' id='type-id-444'/>
    <class-decl name='fsid' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-440' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-446'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_fileno' type-id='type-id-413' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-417' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-238' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_pad0' type-id='type-id-238' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='d_namlen' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='d_pad1' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_name' type-id='type-id-198' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-447'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <typedef-decl name='get_all_cb_t' type-id='type-id-448' id='type-id-449'/>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-448'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-450' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-159' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-450'/>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='options'/>
      <parameter type-id='type-id-4' name='flags'/>
      <parameter type-id='type-id-2' name='mountpoint'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-433'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='mkdirp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='statfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='stat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-433'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='openat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fdopendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='readdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-452'/>
      <return type-id='type-id-453'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-452'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='do_mount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sa_commit_shares' mangled-name='sa_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_commit_shares'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='do_unmount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sa_is_shared' mangled-name='sa_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_is_shared'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='sa_disable_share' mangled-name='sa_disable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_disable_share'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sa_errorstr' mangled-name='sa_errorstr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_errorstr'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_shareall' mangled-name='zfs_shareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_shareall'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-4' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sa_enable_share' mangled-name='sa_enable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_enable_share'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='changelist_unshare' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <parameter type-id='type-id-451'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-243' name='where'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-243' name='where'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='sa_validate_shareopts' mangled-name='sa_validate_shareopts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_validate_shareopts'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-2' name='proto'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='mountpoint'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-283' name='zhp'/>
      <parameter type-id='type-id-2' name='mountpoint'/>
      <parameter type-id='type-id-2' name='proto'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rmdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-454' name='cbp'/>
      <parameter type-id='type-id-283' name='zhp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-45'/>
    </function-decl>
