<abi-corpus path='libzfs_core.so' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libudev.so.0'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libm.so.5'/>
    <dependency name='libintl.so.8'/>
    <dependency name='libutil.so.9'/>
    <dependency name='libgeom.so.5'/>
    <dependency name='libthr.so.3'/>
    <dependency name='libc.so.7'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zfs_dev_is_whole_disk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dirnamelen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_underlying_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_ioctl_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_isnumber' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicebytes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum_format' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_niceraw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicetime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_resolve_shortname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libavl' language='LANG_C99'>
    <typedef-decl name='avl_tree_t' type-id='type-id-1' id='type-id-2'/>
    <typedef-decl name='avl_index_t' type-id='type-id-3' id='type-id-4'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-5'/>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-5' name='tree'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-5' name='tree'/>
      <parameter type-id='type-id-4' name='where'/>
      <parameter type-id='type-id-7' name='direction'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-5' name='tree'/>
      <parameter type-id='type-id-6' name='new_data'/>
      <parameter type-id='type-id-6' name='here'/>
      <parameter type-id='type-id-7' name='direction'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-5' name='tree'/>
      <parameter type-id='type-id-6' name='new_node'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-5' name='tree'/>
      <parameter type-id='type-id-6' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-5' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-5' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-5' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-5' name='tree1'/>
      <parameter type-id='type-id-5' name='tree2'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-5' name='tree'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-5' name='tree'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-13' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-7'/>
    <typedef-decl name='boolean_t' type-id='type-id-14' id='type-id-9'/>
    <typedef-decl name='uintptr_t' type-id='type-id-15' id='type-id-3'/>
    <typedef-decl name='ulong_t' type-id='type-id-16' id='type-id-10'/>
    <type-decl name='void' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-11'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-14'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-12'/>
    <typedef-decl name='__uintptr_t' type-id='type-id-20' id='type-id-15'/>
    <typedef-decl name='size_t' type-id='type-id-21' id='type-id-13'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-16'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__size_t' type-id='type-id-20' id='type-id-21'/>
    <typedef-decl name='__uint64_t' type-id='type-id-16' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='128' id='type-id-22'>
      <subrange length='2' type-id='type-id-23' id='type-id-24'/>
    </array-type-def>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-23'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-7' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <typedef-decl name='uchar_t' type-id='type-id-26' id='type-id-27'/>
    <typedef-decl name='uint16_t' type-id='type-id-28' id='type-id-29'/>
    <typedef-decl name='ushort_t' type-id='type-id-30' id='type-id-31'/>
    <typedef-decl name='int8_t' type-id='type-id-32' id='type-id-33'/>
    <typedef-decl name='__int8_t' type-id='type-id-25' id='type-id-32'/>
    <typedef-decl name='int64_t' type-id='type-id-34' id='type-id-35'/>
    <qualified-type-def type-id='type-id-27' volatile='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-29' volatile='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-40' volatile='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-43' volatile='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-46' volatile='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-49' volatile='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-10' volatile='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-31' volatile='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar' mangled-name='atomic_inc_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-39' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort' mangled-name='atomic_inc_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-42' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_uint' mangled-name='atomic_inc_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_64' mangled-name='atomic_inc_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar' mangled-name='atomic_dec_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-39' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort' mangled-name='atomic_dec_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-42' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_uint' mangled-name='atomic_dec_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_dec_64' mangled-name='atomic_dec_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_char' mangled-name='atomic_add_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_short' mangled-name='atomic_add_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_int' mangled-name='atomic_add_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_64' mangled-name='atomic_add_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-35' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-61' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_char' mangled-name='atomic_sub_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_short' mangled-name='atomic_sub_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_int' mangled-name='atomic_sub_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_64' mangled-name='atomic_sub_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-35' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-61' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_uchar' mangled-name='atomic_or_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_ushort' mangled-name='atomic_or_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_uint' mangled-name='atomic_or_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_or_64' mangled-name='atomic_or_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_uchar' mangled-name='atomic_and_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_ushort' mangled-name='atomic_and_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_uint' mangled-name='atomic_and_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_and_64' mangled-name='atomic_and_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar_nv' mangled-name='atomic_inc_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort_nv' mangled-name='atomic_inc_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_inc_uint_nv' mangled-name='atomic_inc_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_inc_64_nv' mangled-name='atomic_inc_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar_nv' mangled-name='atomic_dec_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort_nv' mangled-name='atomic_dec_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_dec_uint_nv' mangled-name='atomic_dec_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_dec_64_nv' mangled-name='atomic_dec_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_add_char_nv' mangled-name='atomic_add_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_add_short_nv' mangled-name='atomic_add_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_add_int_nv' mangled-name='atomic_add_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_add_64_nv' mangled-name='atomic_add_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-35' name='bits'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-61' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_sub_char_nv' mangled-name='atomic_sub_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_sub_short_nv' mangled-name='atomic_sub_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_sub_int_nv' mangled-name='atomic_sub_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_sub_64_nv' mangled-name='atomic_sub_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-35' name='bits'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-61' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_or_uchar_nv' mangled-name='atomic_or_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_or_ushort_nv' mangled-name='atomic_or_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='bits'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_or_uint_nv' mangled-name='atomic_or_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_or_64_nv' mangled-name='atomic_or_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_and_uchar_nv' mangled-name='atomic_and_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar_nv'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_and_ushort_nv' mangled-name='atomic_and_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='bits'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_and_uint_nv' mangled-name='atomic_and_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_and_64_nv' mangled-name='atomic_and_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='exp'/>
      <parameter type-id='type-id-46' name='des'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_cas_uchar' mangled-name='atomic_cas_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='exp'/>
      <parameter type-id='type-id-27' name='des'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='exp'/>
      <parameter type-id='type-id-29' name='des'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_cas_ushort' mangled-name='atomic_cas_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='exp'/>
      <parameter type-id='type-id-31' name='des'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='exp'/>
      <parameter type-id='type-id-40' name='des'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_cas_uint' mangled-name='atomic_cas_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='exp'/>
      <parameter type-id='type-id-49' name='des'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='exp'/>
      <parameter type-id='type-id-10' name='des'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_cas_64' mangled-name='atomic_cas_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='exp'/>
      <parameter type-id='type-id-43' name='des'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-6' name='exp'/>
      <parameter type-id='type-id-6' name='des'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_swap_uchar' mangled-name='atomic_swap_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uchar'>
      <parameter type-id='type-id-37' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-39' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_swap_ushort' mangled-name='atomic_swap_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-42' name='target'/>
      <parameter type-id='type-id-40' name='bits'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='atomic_swap_uint' mangled-name='atomic_swap_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_swap_64' mangled-name='atomic_swap_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-60' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-49' name='value'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-49' name='value'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='membar_exit' mangled-name='membar_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_exit'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-57'/>
    <typedef-decl name='__int64_t' type-id='type-id-59' id='type-id-34'/>
    <typedef-decl name='__uint16_t' type-id='type-id-30' id='type-id-28'/>
    <typedef-decl name='int16_t' type-id='type-id-62' id='type-id-56'/>
    <typedef-decl name='int32_t' type-id='type-id-63' id='type-id-58'/>
    <typedef-decl name='ssize_t' type-id='type-id-64' id='type-id-61'/>
    <typedef-decl name='uint32_t' type-id='type-id-65' id='type-id-40'/>
    <typedef-decl name='uint64_t' type-id='type-id-20' id='type-id-43'/>
    <typedef-decl name='uint8_t' type-id='type-id-66' id='type-id-46'/>
    <typedef-decl name='uint_t' type-id='type-id-67' id='type-id-49'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-26'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-30'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-60'/>
    <typedef-decl name='__int16_t' type-id='type-id-57' id='type-id-62'/>
    <typedef-decl name='__int32_t' type-id='type-id-7' id='type-id-63'/>
    <typedef-decl name='__ssize_t' type-id='type-id-34' id='type-id-64'/>
    <typedef-decl name='__uint32_t' type-id='type-id-67' id='type-id-65'/>
    <typedef-decl name='__uint8_t' type-id='type-id-26' id='type-id-66'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-67'/>
    <qualified-type-def type-id='type-id-8' volatile='yes' id='type-id-68'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-69'/>
    <type-decl name='char' size-in-bits='8' id='type-id-71'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-72'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <typedef-decl name='list_t' type-id='type-id-73' id='type-id-74'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-76' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-75' id='type-id-77'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-79'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-13' name='size'/>
      <parameter type-id='type-id-13' name='offset'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <parameter type-id='type-id-6' name='nobject'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <parameter type-id='type-id-6' name='nobject'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-79' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-79' name='dst'/>
      <parameter type-id='type-id-79' name='src'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-78' name='lold'/>
      <parameter type-id='type-id-78' name='lnew'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-78' name='ln'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-78' name='ln'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-79' name='list'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-69' name='d'/>
      <parameter type-id='type-id-80' name='mode'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='mode_t' type-id='type-id-84' id='type-id-80'/>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-83'/>
    <typedef-decl name='__mode_t' type-id='type-id-28' id='type-id-84'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/getexecname.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-82'/>
    <function-decl name='sysctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-85'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/gethostid.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='gethostid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/getmntany.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='128' id='type-id-86'>
      <subrange length='16' type-id='type-id-23' id='type-id-87'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='640' id='type-id-88'>
      <subrange length='80' type-id='type-id-23' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='64' id='type-id-90'>
      <subrange length='2' type-id='type-id-23' id='type-id-24'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='640' id='type-id-91'>
      <subrange length='10' type-id='type-id-23' id='type-id-92'/>
    </array-type-def>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='statfs' size-in-bits='18752' is-struct='yes' visibility='default' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_version' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='f_type' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_flags' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_bsize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_iosize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_blocks' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_bfree' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_bavail' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_files' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_ffree' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_syncwrites' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_asyncwrites' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_syncreads' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_asyncreads' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_spare' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_namemax' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='f_owner' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_fsid' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='f_charspare' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='f_fstypename' type-id='type-id-86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='f_mntfromname' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='f_mntonname' type-id='type-id-97' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fsid_t' type-id='type-id-98' id='type-id-96'/>
    <class-decl name='fsid' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-90' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-102'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-69' name='path'/>
      <parameter type-id='type-id-100' name='entry'/>
      <parameter type-id='type-id-103' name='statbuf'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='statfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='statfs2mnttab' mangled-name='statfs2mnttab' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statfs2mnttab'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-101'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='8192' id='type-id-97'>
      <subrange length='1024' type-id='type-id-23' id='type-id-104'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-103'/>
    <typedef-decl name='uid_t' type-id='type-id-106' id='type-id-95'/>
    <class-decl name='stat' size-in-bits='1792' is-struct='yes' visibility='default' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='st_padding0' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='st_padding1' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_atim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_mtim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='st_ctim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='st_birthtim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='st_size' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='st_blocks' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='st_blksize' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='st_flags' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='st_gen' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='st_spare' type-id='type-id-116' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uid_t' type-id='type-id-65' id='type-id-106'/>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='640' id='type-id-116'>
      <subrange length='10' type-id='type-id-23' id='type-id-92'/>
    </array-type-def>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-59' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='blkcnt_t' type-id='type-id-118' id='type-id-113'/>
    <typedef-decl name='blksize_t' type-id='type-id-119' id='type-id-114'/>
    <typedef-decl name='dev_t' type-id='type-id-120' id='type-id-107'/>
    <typedef-decl name='fflags_t' type-id='type-id-121' id='type-id-115'/>
    <typedef-decl name='gid_t' type-id='type-id-122' id='type-id-110'/>
    <typedef-decl name='ino_t' type-id='type-id-123' id='type-id-108'/>
    <typedef-decl name='nlink_t' type-id='type-id-124' id='type-id-109'/>
    <typedef-decl name='off_t' type-id='type-id-125' id='type-id-112'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-34' id='type-id-118'/>
    <typedef-decl name='__blksize_t' type-id='type-id-63' id='type-id-119'/>
    <typedef-decl name='__dev_t' type-id='type-id-20' id='type-id-120'/>
    <typedef-decl name='__fflags_t' type-id='type-id-65' id='type-id-121'/>
    <typedef-decl name='__gid_t' type-id='type-id-65' id='type-id-122'/>
    <typedef-decl name='__ino_t' type-id='type-id-20' id='type-id-123'/>
    <typedef-decl name='__nlink_t' type-id='type-id-20' id='type-id-124'/>
    <typedef-decl name='__off_t' type-id='type-id-34' id='type-id-125'/>
    <typedef-decl name='time_t' type-id='type-id-126' id='type-id-117'/>
    <typedef-decl name='__time_t' type-id='type-id-34' id='type-id-126'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/mnttab.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1024' id='type-id-127'>
      <subrange length='128' type-id='type-id-23' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='8' id='type-id-129'>
      <subrange length='1' type-id='type-id-23' id='type-id-130'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='24' id='type-id-131'>
      <subrange length='3' type-id='type-id-23' id='type-id-132'/>
    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-133' id='type-id-134'/>
    <class-decl name='__sFILE' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_p' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_r' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_w' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_flags' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='_file' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_bf' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_lbfsize' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_cookie' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_close' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_read' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_seek' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_write' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_ub' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_up' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_ur' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_ubuf' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_nbuf' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_lb' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_blksize' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_fl_mutex' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_fl_owner' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_fl_count' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='_orientation' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_mbstate' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_flags2' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__sbuf' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_size' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-125' id='type-id-141'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-145' id='type-id-144'/>
    <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' id='type-id-145'>
      <data-member access='private'>
        <var-decl name='__mbstate8' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_mbstateL' type-id='type-id-34' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-139'/>
    <function-decl name='hasmntopt' mangled-name='hasmntopt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hasmntopt'>
      <parameter type-id='type-id-101' name='mnt'/>
      <parameter type-id='type-id-70' name='opt'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-146' name='fd'/>
      <parameter type-id='type-id-101' name='mgetp'/>
      <parameter type-id='type-id-101' name='mrefp'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getfsstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getmntent' mangled-name='getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent'>
      <parameter type-id='type-id-146' name='fp'/>
      <parameter type-id='type-id-101' name='mp'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lseek' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-141'/>
    </function-type>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-135'/>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-152'/>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-153'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/zone.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-7' id='type-id-154'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-154'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-155' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-161'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-49' name='timestamp_fmt'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-161'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='thread_pool.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libtpool' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='128' id='type-id-162'>
      <subrange length='4' type-id='type-id-23' id='type-id-163'/>
    </array-type-def>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-152'/>
    <class-decl name='pthread_cond' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-164'/>
    <class-decl name='pthread_cond_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-165'/>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__sigset' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-162' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-168' id='type-id-169'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-142' id='type-id-170'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-171' id='type-id-172'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='type-id-175' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='type-id-173' id='type-id-176'/>
    <typedef-decl name='pthread_t' type-id='type-id-143' id='type-id-175'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_job_t' type-id='type-id-177' id='type-id-180'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-181' id='type-id-182'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <qualified-type-def type-id='type-id-166' const='yes' id='type-id-186'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-181' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-195'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <function-decl name='pthread_attr_getstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_cond_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-196'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-197'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-187'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_sigmask' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-185'/>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='type-id-198' name='tpool'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='type-id-198' name='tpool'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='type-id-198' name='tpool'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='type-id-198' name='tpool'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tpool_member' mangled-name='tpool_member' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='type-id-198' name='tpool'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <class-decl name='tpool' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_busycv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_workcv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_waitcv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_active' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_head' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_tail' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_attr' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_flags' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='tp_linger' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_njobs' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='tp_minimum' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_maximum' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='tp_current' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_idle' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='type-id-199'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-201'/>
    <class-decl name='pthread_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-204'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_core.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzfs_core' language='LANG_C99'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-23'/>
    <type-decl name='char' size-in-bits='8' id='type-id-71'/>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='8192' id='type-id-97'>
      <subrange length='1024' type-id='type-id-23' id='type-id-104'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='16384' id='type-id-206'>
      <subrange length='2048' type-id='type-id-23' id='type-id-207'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2048' id='type-id-208'>
      <subrange length='256' type-id='type-id-23' id='type-id-209'/>
    </array-type-def>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-153'/>
    <type-decl name='int' size-in-bits='32' id='type-id-7'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-57'/>
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='128' id='type-id-210'>
      <subrange length='2' type-id='type-id-23' id='type-id-24'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='2176' id='type-id-211'>
      <subrange length='34' type-id='type-id-23' id='type-id-212'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='256' id='type-id-213'>
      <subrange length='4' type-id='type-id-23' id='type-id-163'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='96' id='type-id-214'>
      <subrange length='12' type-id='type-id-23' id='type-id-215'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='128' id='type-id-216'>
      <subrange length='16' type-id='type-id-23' id='type-id-87'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='24' id='type-id-217'>
      <subrange length='3' type-id='type-id-23' id='type-id-132'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='40' id='type-id-218'>
      <subrange length='5' type-id='type-id-23' id='type-id-219'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='48' id='type-id-220'>
      <subrange length='6' type-id='type-id-23' id='type-id-221'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='64' id='type-id-222'>
      <subrange length='8' type-id='type-id-23' id='type-id-223'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-18'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-26'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-67'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-16'/>
    <type-decl name='variadic parameter type' id='type-id-224'/>
    <type-decl name='void' id='type-id-8'/>
    <enum-decl name='lzc_dataset_type' id='type-id-225'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-226' id='type-id-227'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-63' id='type-id-58'/>
    <typedef-decl name='__int32_t' type-id='type-id-7' id='type-id-63'/>
    <typedef-decl name='uint32_t' type-id='type-id-65' id='type-id-40'/>
    <typedef-decl name='__uint32_t' type-id='type-id-67' id='type-id-65'/>
    <typedef-decl name='uint64_t' type-id='type-id-20' id='type-id-43'/>
    <typedef-decl name='__uint64_t' type-id='type-id-16' id='type-id-20'/>
    <typedef-decl name='uint8_t' type-id='type-id-66' id='type-id-46'/>
    <typedef-decl name='__uint8_t' type-id='type-id-26' id='type-id-66'/>
    <typedef-decl name='uint_t' type-id='type-id-67' id='type-id-49'/>
    <class-decl name='zfs_cmd' size-in-bits='36224' is-struct='yes' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='zc_nvlist_src' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='zc_pad2' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='zc_history' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='zc_value' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='zc_string' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27008'>
        <var-decl name='zc_guid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27072'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27136'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27200'>
        <var-decl name='zc_cookie' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27264'>
        <var-decl name='zc_objset_type' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27328'>
        <var-decl name='zc_perm_action' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27392'>
        <var-decl name='zc_history_len' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='zc_history_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='zc_obj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='zc_iflags' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='zc_share' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='zc_objset_stats' type-id='type-id-230' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30208'>
        <var-decl name='zc_begin_record' type-id='type-id-231' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32640'>
        <var-decl name='zc_inject_record' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35456'>
        <var-decl name='zc_defer_destroy' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35488'>
        <var-decl name='zc_flags' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35520'>
        <var-decl name='zc_action_handle' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35584'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35616'>
        <var-decl name='zc_simple' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35624'>
        <var-decl name='zc_pad' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35648'>
        <var-decl name='zc_sendobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35712'>
        <var-decl name='zc_fromobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35776'>
        <var-decl name='zc_createtxg' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35840'>
        <var-decl name='zc_stat' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36160'>
        <var-decl name='zc_zoneid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-14' id='type-id-9'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-14'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-234' id='type-id-229'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-235' id='type-id-230'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-237' id='type-id-236'/>
    <enum-decl name='dmu_objset_type' id='type-id-237'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-238' id='type-id-232'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-40' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-239' id='type-id-233'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-210' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-241' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-62' id='type-id-56'/>
    <typedef-decl name='__int16_t' type-id='type-id-57' id='type-id-62'/>
    <typedef-decl name='data_type_t' type-id='type-id-242' id='type-id-241'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-242'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <enum-decl name='lzc_send_flags' id='type-id-243'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_replay_record_t' type-id='type-id-244' id='type-id-245'/>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-246' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-247' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-246'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='type-id-247'>
      <data-member access='private'>
        <var-decl name='drr_begin' type-id='type-id-231' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_end' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object' type-id='type-id-249' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_freeobjects' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write' type-id='type-id-251' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_free' type-id='type-id-252' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_byref' type-id='type-id-253' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_spill' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_embedded' type-id='type-id-255' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object_range' type-id='type-id-256' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_redact' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_checksum' type-id='type-id-258' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_cksum_t' type-id='type-id-260' id='type-id-259'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-213' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-262' id='type-id-261'/>
    <enum-decl name='dmu_object_type' id='type-id-262'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-216' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-264' id='type-id-263'/>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-263' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='type-id-261' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='type-id-40' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='type-id-217' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='type-id-259' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-265' id='type-id-266'/>
    <enum-decl name='pool_initialize_func' id='type-id-265'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-267' id='type-id-268'/>
    <enum-decl name='pool_trim_func' id='type-id-267'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-269' id='type-id-270'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-269'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-271' id='type-id-272'/>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-271'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-70'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-245' const='yes' id='type-id-274'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-276'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-285'/>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-225' name='type'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-284' name='wkeydata'/>
      <parameter type-id='type-id-49' name='wkeylen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-69'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-280' name='props'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-70' name='snapnamebuf'/>
      <parameter type-id='type-id-7' name='snapnamelen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='type-id-69' name='source'/>
      <parameter type-id='type-id-69' name='target'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='type-id-69' name='fsname'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='type-id-280' name='snaps'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-282'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='type-id-280' name='snaps'/>
      <parameter type-id='type-id-9' name='defer'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='type-id-69' name='firstsnap'/>
      <parameter type-id='type-id-69' name='lastsnap'/>
      <parameter type-id='type-id-283' name='usedp'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='type-id-69' name='dataset'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='type-id-69' name='pool_name'/>
      <parameter type-id='type-id-280' name='innvl'/>
      <parameter type-id='type-id-281' name='outnvl'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='type-id-280' name='holds'/>
      <parameter type-id='type-id-7' name='cleanup_fd'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='type-id-280' name='holds'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-281' name='holdsp'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-243' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-243' name='flags'/>
      <parameter type-id='type-id-43' name='resumeobj'/>
      <parameter type-id='type-id-43' name='resumeoff'/>
      <parameter type-id='type-id-69' name='redactbook'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-243' name='flags'/>
      <parameter type-id='type-id-69' name='redactbook'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-243' name='flags'/>
      <parameter type-id='type-id-43' name='resumeobj'/>
      <parameter type-id='type-id-43' name='resumeoff'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-243' name='flags'/>
      <parameter type-id='type-id-43' name='resumeobj'/>
      <parameter type-id='type-id-43' name='resumeoff'/>
      <parameter type-id='type-id-43' name='resume_bytes'/>
      <parameter type-id='type-id-69' name='redactbook'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-283' name='spacep'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-69' name='from'/>
      <parameter type-id='type-id-243' name='flags'/>
      <parameter type-id='type-id-283' name='spacep'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-9' name='force'/>
      <parameter type-id='type-id-9' name='raw'/>
      <parameter type-id='type-id-7' name='fd'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-9' name='force'/>
      <parameter type-id='type-id-9' name='raw'/>
      <parameter type-id='type-id-7' name='fd'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-9' name='force'/>
      <parameter type-id='type-id-9' name='resumable'/>
      <parameter type-id='type-id-9' name='raw'/>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-275' name='begin_record'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-9' name='force'/>
      <parameter type-id='type-id-9' name='resumable'/>
      <parameter type-id='type-id-9' name='raw'/>
      <parameter type-id='type-id-7' name='input_fd'/>
      <parameter type-id='type-id-275' name='begin_record'/>
      <parameter type-id='type-id-7' name='cleanup_fd'/>
      <parameter type-id='type-id-283' name='read_bytes'/>
      <parameter type-id='type-id-283' name='errflags'/>
      <parameter type-id='type-id-283' name='action_handle'/>
      <parameter type-id='type-id-281' name='errors'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='type-id-69' name='snapname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-280' name='cmdprops'/>
      <parameter type-id='type-id-284' name='wkeydata'/>
      <parameter type-id='type-id-49' name='wkeylen'/>
      <parameter type-id='type-id-69' name='origin'/>
      <parameter type-id='type-id-9' name='force'/>
      <parameter type-id='type-id-9' name='resumable'/>
      <parameter type-id='type-id-9' name='raw'/>
      <parameter type-id='type-id-7' name='input_fd'/>
      <parameter type-id='type-id-275' name='begin_record'/>
      <parameter type-id='type-id-7' name='cleanup_fd'/>
      <parameter type-id='type-id-283' name='read_bytes'/>
      <parameter type-id='type-id-283' name='errflags'/>
      <parameter type-id='type-id-283' name='action_handle'/>
      <parameter type-id='type-id-281' name='errors'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-70' name='snapnamebuf'/>
      <parameter type-id='type-id-7' name='snapnamelen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-69' name='snapname'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='type-id-280' name='bookmarks'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-281' name='bmarks'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='type-id-69' name='bookmark'/>
      <parameter type-id='type-id-281' name='props'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='type-id-280' name='bmarks'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-69' name='program'/>
      <parameter type-id='type-id-43' name='instrlimit'/>
      <parameter type-id='type-id-43' name='memlimit'/>
      <parameter type-id='type-id-280' name='argnvl'/>
      <parameter type-id='type-id-281' name='outnvl'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='type-id-69' name='pool'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='type-id-69' name='pool'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-69' name='program'/>
      <parameter type-id='type-id-43' name='timeout'/>
      <parameter type-id='type-id-43' name='memlimit'/>
      <parameter type-id='type-id-280' name='argnvl'/>
      <parameter type-id='type-id-281' name='outnvl'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-9' name='noop'/>
      <parameter type-id='type-id-284' name='wkeydata'/>
      <parameter type-id='type-id-49' name='wkeylen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='type-id-69' name='fsname'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='type-id-69' name='fsname'/>
      <parameter type-id='type-id-43' name='crypt_cmd'/>
      <parameter type-id='type-id-280' name='props'/>
      <parameter type-id='type-id-284' name='wkeydata'/>
      <parameter type-id='type-id-49' name='wkeylen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='type-id-69' name='pool_name'/>
      <parameter type-id='type-id-9' name='scrub_restart'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='type-id-69' name='poolname'/>
      <parameter type-id='type-id-266' name='cmd_type'/>
      <parameter type-id='type-id-280' name='vdevs'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='type-id-69' name='poolname'/>
      <parameter type-id='type-id-268' name='cmd_type'/>
      <parameter type-id='type-id-43' name='rate'/>
      <parameter type-id='type-id-9' name='secure'/>
      <parameter type-id='type-id-280' name='vdevs'/>
      <parameter type-id='type-id-281' name='errlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='type-id-69' name='snapshot'/>
      <parameter type-id='type-id-69' name='bookname'/>
      <parameter type-id='type-id-280' name='snapnv'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-270' name='activity'/>
      <parameter type-id='type-id-273' name='waited'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-270' name='activity'/>
      <parameter type-id='type-id-43' name='tag'/>
      <parameter type-id='type-id-273' name='waited'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='type-id-69' name='fs'/>
      <parameter type-id='type-id-272' name='activity'/>
      <parameter type-id='type-id-273' name='waited'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-277' name='env'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='type-id-69' name='pool'/>
      <parameter type-id='type-id-281' name='outnvl'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/zutil_compat.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <class-decl name='zfs_cmd_legacy' size-in-bits='36352' is-struct='yes' visibility='default' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='zc_nvlist_src' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='zc_pad2' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='zc_history' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='zc_value' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='zc_string' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27008'>
        <var-decl name='zc_guid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27072'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27136'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27200'>
        <var-decl name='zc_cookie' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27264'>
        <var-decl name='zc_objset_type' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27328'>
        <var-decl name='zc_perm_action' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27392'>
        <var-decl name='zc_history_len' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='zc_history_offset' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='zc_obj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='zc_iflags' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='zc_share' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='zc_jailid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27968'>
        <var-decl name='zc_objset_stats' type-id='type-id-230' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30272'>
        <var-decl name='zc_begin_record' type-id='type-id-245' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_inject_record' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35584'>
        <var-decl name='zc_defer_destroy' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35616'>
        <var-decl name='zc_flags' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35648'>
        <var-decl name='zc_action_handle' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35712'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35744'>
        <var-decl name='zc_simple' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35752'>
        <var-decl name='zc_pad3' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35776'>
        <var-decl name='zc_resumable' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35808'>
        <var-decl name='zc_pad4' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35840'>
        <var-decl name='zc_sendobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35904'>
        <var-decl name='zc_fromobj' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35968'>
        <var-decl name='zc_createtxg' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36032'>
        <var-decl name='zc_stat' type-id='type-id-233' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <function-decl name='zfs_ioctl_ozfs_to_legacy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zfs_cmd_ozfs_to_legacy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_cmd_legacy_to_ozfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-287'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='errx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-69'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/zutil_device_path_os.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-288'/>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='type-id-70' name='dev'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='type-id-70' name='path'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='type-id-69' name='dev_name'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='type-id-69' name='dev_name'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='type-id-69' name='path'/>
      <parameter type-id='type-id-7' name='timeout_ms'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='clock_gettime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='usleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='type-id-69' name='path'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/zutil_import_os.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <class-decl name='gmesh' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_class' type-id='type-id-290' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_ident' type-id='type-id-291' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-292' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gclass' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_id' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_name' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_class' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lg_geom' type-id='type-id-295' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lg_config' type-id='type-id-296' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-297' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-298' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ggeom' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_id' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_class' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_name' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lg_rank' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lg_geom' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lg_consumer' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lg_provider' type-id='type-id-303' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lg_config' type-id='type-id-296' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u_int' type-id='type-id-67' id='type-id-300'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-304' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gconsumer' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_id' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_geom' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_consumer' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lg_provider' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lg_consumers' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lg_mode' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lg_config' type-id='type-id-296' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-309' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gprovider' size-in-bits='768' is-struct='yes' visibility='default' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_id' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_name' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_geom' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lg_provider' type-id='type-id-311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lg_consumers' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lg_mode' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lg_mediasize' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lg_sectorsize' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='lg_stripeoffset' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lg_stripesize' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lg_config' type-id='type-id-296' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-312' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-308' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gconf' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-313' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gconfig' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_config' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_name' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lg_val' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-316' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-307' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gident' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lg_id' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lg_ptr' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lg_what' type-id='type-id-318' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-318'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ISCLASS' value='0'/>
      <enumerator name='ISGEOM' value='1'/>
      <enumerator name='ISPROVIDER' value='2'/>
      <enumerator name='ISCONSUMER' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-312'/>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='geom_gettree' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-319'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='sysctlbyname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zutil_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zutil_strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='geom_deletetree' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-319'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='type-id-7' name='fd'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-320'/>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-323'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-325' id='type-id-324'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-325'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-328' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-327'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-331' id='type-id-329'/>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-332' id='type-id-330'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_device_path.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <typedef-decl name='ssize_t' type-id='type-id-64' id='type-id-61'/>
    <typedef-decl name='__ssize_t' type-id='type-id-34' id='type-id-64'/>
    <typedef-decl name='__int64_t' type-id='type-id-59' id='type-id-34'/>
    <typedef-decl name='size_t' type-id='type-id-21' id='type-id-13'/>
    <typedef-decl name='__size_t' type-id='type-id-20' id='type-id-21'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <function-decl name='zfs_basename' mangled-name='zfs_basename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_basename'>
      <parameter type-id='type-id-69' name='path'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='zfs_dirnamelen' mangled-name='zfs_dirnamelen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dirnamelen'>
      <parameter type-id='type-id-69' name='path'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='type-id-69' name='name'/>
      <parameter type-id='type-id-70' name='path'/>
      <parameter type-id='type-id-13' name='len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='strtok_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-333'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-335'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='type-id-69' name='name'/>
      <parameter type-id='type-id-69' name='cmp'/>
      <parameter type-id='type-id-7' name='wholedisk'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_import.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='640' id='type-id-116'>
      <subrange length='10' type-id='type-id-23' id='type-id-92'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='128' id='type-id-22'>
      <subrange length='2' type-id='type-id-23' id='type-id-24'/>
    </array-type-def>
    <class-decl name='_dirdesc' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-336'/>
    <class-decl name='pthread_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-204'/>
    <class-decl name='pthread_mutex_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-337'/>
    <class-decl name='tpool' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_busycv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_workcv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_waitcv' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_active' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_head' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_tail' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_attr' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_flags' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='tp_linger' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_njobs' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='tp_minimum' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_maximum' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='tp_current' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_idle' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='64' id='type-id-338'>
      <subrange length='2' type-id='type-id-23' id='type-id-24'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='512' id='type-id-339'>
      <subrange length='8' type-id='type-id-23' id='type-id-223'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-30'/>
    <class-decl name='stat' size-in-bits='1792' is-struct='yes' visibility='default' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='st_padding0' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='st_padding1' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_atim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_mtim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='st_ctim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='st_birthtim' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='st_size' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='st_blocks' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='st_blksize' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='st_flags' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='st_gen' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='st_spare' type-id='type-id-116' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dev_t' type-id='type-id-120' id='type-id-107'/>
    <typedef-decl name='__dev_t' type-id='type-id-20' id='type-id-120'/>
    <typedef-decl name='ino_t' type-id='type-id-123' id='type-id-108'/>
    <typedef-decl name='__ino_t' type-id='type-id-20' id='type-id-123'/>
    <typedef-decl name='nlink_t' type-id='type-id-124' id='type-id-109'/>
    <typedef-decl name='__nlink_t' type-id='type-id-20' id='type-id-124'/>
    <typedef-decl name='mode_t' type-id='type-id-84' id='type-id-80'/>
    <typedef-decl name='__mode_t' type-id='type-id-28' id='type-id-84'/>
    <typedef-decl name='__uint16_t' type-id='type-id-30' id='type-id-28'/>
    <typedef-decl name='uid_t' type-id='type-id-106' id='type-id-95'/>
    <typedef-decl name='__uid_t' type-id='type-id-65' id='type-id-106'/>
    <typedef-decl name='gid_t' type-id='type-id-122' id='type-id-110'/>
    <typedef-decl name='__gid_t' type-id='type-id-65' id='type-id-122'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-59' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-126' id='type-id-117'/>
    <typedef-decl name='__time_t' type-id='type-id-34' id='type-id-126'/>
    <typedef-decl name='off_t' type-id='type-id-125' id='type-id-112'/>
    <typedef-decl name='__off_t' type-id='type-id-34' id='type-id-125'/>
    <typedef-decl name='blkcnt_t' type-id='type-id-118' id='type-id-113'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-34' id='type-id-118'/>
    <typedef-decl name='blksize_t' type-id='type-id-119' id='type-id-114'/>
    <typedef-decl name='__blksize_t' type-id='type-id-63' id='type-id-119'/>
    <typedef-decl name='fflags_t' type-id='type-id-121' id='type-id-115'/>
    <typedef-decl name='__fflags_t' type-id='type-id-65' id='type-id-121'/>
    <class-decl name='aiocb' size-in-bits='1280' is-struct='yes' visibility='default' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aio_fildes' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aio_offset' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aio_buf' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='aio_nbytes' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__spare__' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__spare2__' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aio_lio_opcode' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='aio_reqprio' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_aiocb_private' type-id='type-id-341' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='aio_sigevent' type-id='type-id-342' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__aiocb_private' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kernelinfo' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sigevent' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sigev_notify' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sigev_signo' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigev_value' type-id='type-id-343' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sigev_un' type-id='type-id-344' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='type-id-343'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sigval_int' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sigval_ptr' type-id='type-id-6' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' id='type-id-344'>
      <data-member access='private'>
        <var-decl name='_threadid' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigev_thread' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_kevent_flags' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__spare__' type-id='type-id-339' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__lwpid_t' type-id='type-id-63' id='type-id-345'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-346'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_function' type-id='type-id-347' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_attribute' type-id='type-id-202' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='importargs_t' type-id='type-id-348' id='type-id-349'/>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-333' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='type-id-280' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-325' id='type-id-324'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-328' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-332' id='type-id-330'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-331' id='type-id-329'/>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-13' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-15' id='type-id-3'/>
    <typedef-decl name='__uintptr_t' type-id='type-id-20' id='type-id-15'/>
    <typedef-decl name='ulong_t' type-id='type-id-16' id='type-id-10'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_fileno' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_pad0' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='d_namlen' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='d_pad1' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_name' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-352'/>
    <qualified-type-def type-id='type-id-352' restrict='yes' id='type-id-353'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-358'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-325'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-323'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-361'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-363'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-364'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-8' volatile='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-60'/>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='type-id-7' name='fd'/>
      <parameter type-id='type-id-281' name='config'/>
      <parameter type-id='type-id-81' name='num_labels'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_memalign' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='lio_listio' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-366'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aio_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aio_return' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-352'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='pread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-362'/>
      <parameter type-id='type-id-368'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-333'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='type-id-6' name='hdl'/>
      <parameter type-id='type-id-361' name='import'/>
      <parameter type-id='type-id-322' name='pco'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-365'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zpool_find_import_blkid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-355'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='stat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='realpath' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='geteuid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='type-id-6' name='hdl'/>
      <parameter type-id='type-id-69' name='target'/>
      <parameter type-id='type-id-281' name='configp'/>
      <parameter type-id='type-id-361' name='args'/>
      <parameter type-id='type-id-322' name='pco'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='tpool_create' mangled-name='tpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-367'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-354'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='type-id-367'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-354'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-369'/>
      <parameter type-id='type-id-368'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='opendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-351'/>
    </function-decl>
    <function-decl name='readdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-360'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-69'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='type-id-278'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-331'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-273'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-19'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-332'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-280'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-370'>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-205'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_nicenum.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <enum-decl name='zfs_nicenum_format' id='type-id-371'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='type-id-69' name='str'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='type-id-43' name='num'/>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-13' name='buflen'/>
      <parameter type-id='type-id-371' name='format'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='type-id-43' name='num'/>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-13' name='buflen'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_nicetime' mangled-name='zfs_nicetime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicetime'>
      <parameter type-id='type-id-43' name='num'/>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-13' name='buflen'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_niceraw' mangled-name='zfs_niceraw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_niceraw'>
      <parameter type-id='type-id-43' name='num'/>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-13' name='buflen'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicebytes'>
      <parameter type-id='type-id-43' name='num'/>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-13' name='buflen'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_pool.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libzutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-372' size-in-bits='32768' id='type-id-373'>
      <subrange length='64' type-id='type-id-23' id='type-id-374'/>
    </array-type-def>
    <typedef-decl name='ddt_stat_t' type-id='type-id-375' id='type-id-372'/>
    <class-decl name='ddt_stat' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_blocks' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_lsize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_psize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_dsize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dds_ref_blocks' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dds_ref_lsize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dds_ref_psize' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dds_ref_dsize' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_histogram_t' type-id='type-id-376' id='type-id-377'/>
    <class-decl name='ddt_histogram' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-376'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddh_stat' type-id='type-id-373' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-380'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-383'/>
    <function-decl name='zpool_dump_ddt' mangled-name='zpool_dump_ddt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_dump_ddt'>
      <parameter type-id='type-id-381' name='dds_total'/>
      <parameter type-id='type-id-379' name='ddh'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_history_unpack' mangled-name='zpool_history_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_history_unpack'>
      <parameter type-id='type-id-70' name='buf'/>
      <parameter type-id='type-id-43' name='bytes_read'/>
      <parameter type-id='type-id-283' name='leftover'/>
      <parameter type-id='type-id-382' name='records'/>
      <parameter type-id='type-id-383' name='numrecords'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
