<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_int32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match_regex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/fnvpair.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-4' name='sizep'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='type-id-5' name='pack'/>
      <parameter type-id='type-id-3' name='size'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='type-id-5' name='buf'/>
      <parameter type-id='type-id-3' name='buflen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='type-id-1' name='dst'/>
      <parameter type-id='type-id-1' name='src'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-7' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-8' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-9' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-10' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-11' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-12' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-13' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-14' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-15' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-16' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-6' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-1' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-17' name='pair'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-18' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-20' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-21' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-22' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-23' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-24' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-25' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-26' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-27' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-28' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-29' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-30' name='val'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-17' name='pair'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <typedef-decl name='boolean_t' type-id='type-id-37' id='type-id-7'/>
    <typedef-decl name='int16_t' type-id='type-id-38' id='type-id-11'/>
    <typedef-decl name='int32_t' type-id='type-id-39' id='type-id-13'/>
    <typedef-decl name='int64_t' type-id='type-id-40' id='type-id-15'/>
    <typedef-decl name='int8_t' type-id='type-id-41' id='type-id-9'/>
    <typedef-decl name='size_t' type-id='type-id-42' id='type-id-3'/>
    <typedef-decl name='uchar_t' type-id='type-id-43' id='type-id-8'/>
    <typedef-decl name='uint16_t' type-id='type-id-44' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-45' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-42' id='type-id-16'/>
    <typedef-decl name='uint8_t' type-id='type-id-43' id='type-id-10'/>
    <typedef-decl name='uint_t' type-id='type-id-45' id='type-id-19'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <type-decl name='void' id='type-id-2'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-33'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-37'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-40'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-38'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-41'/>
    <typedef-decl name='nvlist_t' type-id='type-id-47' id='type-id-35'/>
    <typedef-decl name='nvpair_t' type-id='type-id-48' id='type-id-36'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-45'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-44'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-50' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-50'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <typedef-decl name='bool_t' type-id='type-id-39' id='type-id-51'/>
    <class-decl name='XDR' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='xdr_op' id='type-id-53'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='xdr_ops' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_getint32' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x_putint32' type-id='type-id-67' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XDR' type-id='type-id-52' id='type-id-68'/>
    <typedef-decl name='caddr_t' type-id='type-id-69' id='type-id-55'/>
    <typedef-decl name='__caddr_t' type-id='type-id-5' id='type-id-69'/>
    <typedef-decl name='u_int' type-id='type-id-70' id='type-id-56'/>
    <typedef-decl name='__u_int' type-id='type-id-45' id='type-id-70'/>
    <typedef-decl name='quad_t' type-id='type-id-71' id='type-id-72'/>
    <typedef-decl name='__quad_t' type-id='type-id-40' id='type-id-71'/>
    <typedef-decl name='xdrproc_t' type-id='type-id-73' id='type-id-74'/>
    <typedef-decl name='u_quad_t' type-id='type-id-75' id='type-id-76'/>
    <typedef-decl name='__u_quad_t' type-id='type-id-42' id='type-id-75'/>
    <typedef-decl name='u_short' type-id='type-id-77' id='type-id-78'/>
    <typedef-decl name='__u_short' type-id='type-id-44' id='type-id-77'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-80'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-83'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-54'/>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-107' name='nva'/>
      <parameter type-id='type-id-108' name='nvo'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-19' name='nvflag'/>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-19' name='nvflag'/>
      <parameter type-id='type-id-39' name='kmflag'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-17' name='nvp'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-49' name='type'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-39' name='kmflag'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-7' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-8' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-9' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-10' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-11' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-12' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-13' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-14' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-15' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-16' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-109' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-6' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-18' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-20' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-21' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-22' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-23' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-24' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-25' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-26' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-27' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-28' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-29' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-110' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-1' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-30' name='a'/>
      <parameter type-id='type-id-19' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-17' name='nvp'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-18' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-20' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-21' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-22' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-23' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-24' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-25' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-26' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-27' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-28' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-111' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-112' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-30' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-113' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-114' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-115' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-116' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-117' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-118' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-119' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-120' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-121' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-122' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-123' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-124' name='a'/>
      <parameter type-id='type-id-31' name='n'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-125' name='val'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-39' name='flag'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-91' name='ret'/>
      <parameter type-id='type-id-88' name='ip'/>
      <parameter type-id='type-id-112' name='ep'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-91' name='ret'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-17' name='nvp'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-1' name='dst'/>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-39' name='flag'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-4' name='size'/>
      <parameter type-id='type-id-39' name='encoding'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-112' name='bufp'/>
      <parameter type-id='type-id-4' name='buflen'/>
      <parameter type-id='type-id-39' name='encoding'/>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-112' name='bufp'/>
      <parameter type-id='type-id-4' name='buflen'/>
      <parameter type-id='type-id-39' name='encoding'/>
      <parameter type-id='type-id-39' name='kmflag'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-5' name='buf'/>
      <parameter type-id='type-id-3' name='buflen'/>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-5' name='buf'/>
      <parameter type-id='type-id-3' name='buflen'/>
      <parameter type-id='type-id-30' name='nvlp'/>
      <parameter type-id='type-id-39' name='kmflag'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='bcopy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='xdr_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdrmem_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='xdr_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_longlong_t' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_opaque' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_longlong_t' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_short' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_short' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_char' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_double' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strtol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-108'/>
    <type-decl name='double' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-111'/>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-98'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-126'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-102'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-56'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-2'/>
    </function-type>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='hrtime_t' type-id='type-id-129' id='type-id-110'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-126'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-127'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='nv_alloc_t' type-id='type-id-131' id='type-id-128'/>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-132' id='type-id-130'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-134' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-135'/>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <var-decl name='nv_fixed_ops' type-id='type-id-108' mangled-name='nv_fixed_ops' visibility='default' elf-symbol-id='nv_fixed_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8' id='type-id-141'>
      <subrange length='1' type-id='type-id-142' id='type-id-143'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='160' id='type-id-144'>
      <subrange length='20' type-id='type-id-142' id='type-id-145'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-109'/>
    <type-decl name='int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-40'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-129'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-38'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-41'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-142'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-46'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-45'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-44'/>
    <type-decl name='variadic parameter type' id='type-id-146'/>
    <type-decl name='void' id='type-id-2'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-147' id='type-id-148'/>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-152' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-153' id='type-id-154'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-144' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-39' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-40' id='type-id-157'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-2' id='type-id-161'/>
    <typedef-decl name='__off64_t' type-id='type-id-40' id='type-id-159'/>
    <typedef-decl name='size_t' type-id='type-id-42' id='type-id-3'/>
    <enum-decl name='nvlist_indent_mode' id='type-id-151'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-185' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-189' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-47' id='type-id-35'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-39' id='type-id-13'/>
    <typedef-decl name='uint32_t' type-id='type-id-45' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-42' id='type-id-16'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-37' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-37'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uchar_t' type-id='type-id-43' id='type-id-8'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-193' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int8_t' type-id='type-id-41' id='type-id-9'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='type-id-43' id='type-id-10'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-38' id='type-id-11'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-44' id='type-id-12'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='type-id-40' id='type-id-15'/>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hrtime_t' type-id='type-id-129' id='type-id-110'/>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint_t' type-id='type-id-45' id='type-id-19'/>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='nvlist_prtctl_fmt' id='type-id-217'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-48' id='type-id-36'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-50' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-50'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='regex_t' type-id='type-id-218' id='type-id-219'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='reg_syntax_t' type-id='type-id-42' id='type-id-221'/>
    <typedef-decl name='regmatch_t' type-id='type-id-222' id='type-id-223'/>
    <class-decl name='__anonymous_struct__27' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-223' visibility='default' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-224' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-39' id='type-id-224'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-6'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-126'/>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-150' name='fp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-148' name='pctl'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-151' name='mode'/>
      <parameter type-id='type-id-39' name='start'/>
      <parameter type-id='type-id-39' name='inc'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-39' name='onemore'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-217' name='which'/>
      <parameter type-id='type-id-6' name='fmt'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-217' name='which'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-263' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-277' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-289' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-287' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-297' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-281' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-291' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-283' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-293' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-285' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-295' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-261' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-257' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-279' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-273' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-255' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-299' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-271' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-307' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-265' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-301' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-267' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-303' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-269' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-305' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-259' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-148' name='pctl'/>
      <parameter type-id='type-id-275' name='func'/>
      <parameter type-id='type-id-126' name='private'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-148' name='pctl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-150' name='fp'/>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-1' name='nvl'/>
      <parameter type-id='type-id-148' name='pctl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-1' name='list'/>
      <parameter type-id='type-id-39' name='indent'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-17' name='nvp'/>
      <parameter type-id='type-id-39' name='ai'/>
      <parameter type-id='type-id-5' name='value'/>
      <parameter type-id='type-id-308' name='value_regex'/>
      <parameter type-id='type-id-112' name='ep'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-17' name='nvp'/>
      <parameter type-id='type-id-39' name='ai'/>
      <parameter type-id='type-id-5' name='value'/>
      <parameter type-id='type-id-112' name='ep'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='printf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sscanf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-228'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-230'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-231'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-232'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-233'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-234'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-238'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-240'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-242'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-244'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-246'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-253'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-256'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-258'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-260'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-266'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-268'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-270'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-274'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-276'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-278'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-280'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-282'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-286'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-288'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-292'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-294'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-296'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-302'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-304'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-306'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32' id='type-id-310'>
      <subrange length='4' type-id='type-id-142' id='type-id-311'/>
    </array-type-def>
    <typedef-decl name='wchar_t' type-id='type-id-39' id='type-id-312'/>
    <typedef-decl name='mbstate_t' type-id='type-id-313' id='type-id-314'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-315' id='type-id-313'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-313' visibility='default' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-316' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-316'>
      <data-member access='private'>
        <var-decl name='__wch' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wchb' type-id='type-id-310' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-318'/>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-150' name='fp'/>
      <parameter type-id='type-id-1' name='nvl'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-318'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/allan/zfsonlinux/lib/libnvpair' language='LANG_C89'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-132' id='type-id-130'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-134' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-131' id='type-id-128'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-135'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-107' mangled-name='nv_alloc_nosleep' visibility='default' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <var-decl name='libspl_assert_ok' type-id='type-id-39' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
    <function-decl name='vfprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
