<abi-corpus path='libuutil.so' architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libm.so.5'/>
    <dependency name='libintl.so.8'/>
    <dependency name='libthr.so.3'/>
    <dependency name='libc.so.7'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_list_walk_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_list_walk_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_memdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libavl' language='LANG_C99'>
    <typedef-decl name='avl_tree_t' type-id='type-id-1' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-3' name='tree'/>
      <parameter type-id='type-id-4' name='new_data'/>
      <parameter type-id='type-id-4' name='here'/>
      <parameter type-id='type-id-5' name='direction'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-3' name='tree'/>
      <parameter type-id='type-id-4' name='new_node'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-3' name='t'/>
      <parameter type-id='type-id-4' name='obj'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-3' name='t'/>
      <parameter type-id='type-id-4' name='obj'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-3' name='t'/>
      <parameter type-id='type-id-4' name='obj'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-3' name='tree1'/>
      <parameter type-id='type-id-3' name='tree2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-3' name='tree'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <typedef-decl name='boolean_t' type-id='type-id-14' id='type-id-8'/>
    <type-decl name='void' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-9'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-13'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-14'>
      <underlying-type type-id='type-id-17'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='size_t' type-id='type-id-19' id='type-id-11'/>
    <typedef-decl name='ulong_t' type-id='type-id-20' id='type-id-12'/>
    <type-decl name='char' size-in-bits='8' id='type-id-16'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__size_t' type-id='type-id-23' id='type-id-19'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='128' id='type-id-21'>
      <subrange length='2' type-id='type-id-24' id='type-id-25'/>
    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-20' id='type-id-23'/>
    <typedef-decl name='uintptr_t' type-id='type-id-26' id='type-id-22'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='__uintptr_t' type-id='type-id-23' id='type-id-26'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-5' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-27'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-29'/>
    <typedef-decl name='uchar_t' type-id='type-id-30' id='type-id-31'/>
    <typedef-decl name='uint16_t' type-id='type-id-32' id='type-id-33'/>
    <typedef-decl name='__uint16_t' type-id='type-id-29' id='type-id-32'/>
    <typedef-decl name='ushort_t' type-id='type-id-29' id='type-id-34'/>
    <typedef-decl name='uint_t' type-id='type-id-35' id='type-id-36'/>
    <typedef-decl name='uint64_t' type-id='type-id-23' id='type-id-37'/>
    <typedef-decl name='int16_t' type-id='type-id-38' id='type-id-39'/>
    <typedef-decl name='__int16_t' type-id='type-id-28' id='type-id-38'/>
    <typedef-decl name='int32_t' type-id='type-id-40' id='type-id-41'/>
    <typedef-decl name='__int32_t' type-id='type-id-5' id='type-id-40'/>
    <typedef-decl name='int64_t' type-id='type-id-42' id='type-id-43'/>
    <typedef-decl name='__int64_t' type-id='type-id-27' id='type-id-42'/>
    <typedef-decl name='ssize_t' type-id='type-id-44' id='type-id-45'/>
    <typedef-decl name='__ssize_t' type-id='type-id-42' id='type-id-44'/>
    <qualified-type-def type-id='type-id-31' volatile='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-33' volatile='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-50' volatile='yes' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <qualified-type-def type-id='type-id-37' volatile='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <qualified-type-def type-id='type-id-55' volatile='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-36' volatile='yes' id='type-id-58'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <qualified-type-def type-id='type-id-12' volatile='yes' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <qualified-type-def type-id='type-id-34' volatile='yes' id='type-id-62'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <qualified-type-def type-id='type-id-6' volatile='yes' id='type-id-64'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-57' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar' mangled-name='atomic_inc_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-49' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort' mangled-name='atomic_inc_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-52' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_uint' mangled-name='atomic_inc_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_64' mangled-name='atomic_inc_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64'>
      <parameter type-id='type-id-54' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-57' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar' mangled-name='atomic_dec_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-49' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort' mangled-name='atomic_dec_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-52' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_uint' mangled-name='atomic_dec_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_dec_64' mangled-name='atomic_dec_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64'>
      <parameter type-id='type-id-54' name='target'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_char' mangled-name='atomic_add_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-67' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_short' mangled-name='atomic_add_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_int' mangled-name='atomic_add_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_64' mangled-name='atomic_add_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-45' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_char' mangled-name='atomic_sub_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-67' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_short' mangled-name='atomic_sub_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_int' mangled-name='atomic_sub_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_64' mangled-name='atomic_sub_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-45' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_uchar' mangled-name='atomic_or_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_ushort' mangled-name='atomic_or_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_uint' mangled-name='atomic_or_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_or_64' mangled-name='atomic_or_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_uchar' mangled-name='atomic_and_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_ushort' mangled-name='atomic_and_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_uint' mangled-name='atomic_and_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_64' mangled-name='atomic_and_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar_nv' mangled-name='atomic_inc_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort_nv' mangled-name='atomic_inc_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_inc_uint_nv' mangled-name='atomic_inc_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_inc_64_nv' mangled-name='atomic_inc_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar_nv' mangled-name='atomic_dec_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort_nv' mangled-name='atomic_dec_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_dec_uint_nv' mangled-name='atomic_dec_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_dec_64_nv' mangled-name='atomic_dec_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_add_char_nv' mangled-name='atomic_add_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-67' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_add_short_nv' mangled-name='atomic_add_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_add_int_nv' mangled-name='atomic_add_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_add_64_nv' mangled-name='atomic_add_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-45' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_sub_char_nv' mangled-name='atomic_sub_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-67' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_sub_short_nv' mangled-name='atomic_sub_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_sub_int_nv' mangled-name='atomic_sub_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_sub_64_nv' mangled-name='atomic_sub_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-43' name='bits'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-45' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='bits'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_or_uchar_nv' mangled-name='atomic_or_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_or_ushort_nv' mangled-name='atomic_or_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='bits'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_or_uint_nv' mangled-name='atomic_or_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_or_64_nv' mangled-name='atomic_or_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='bits'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='bits'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_and_uchar_nv' mangled-name='atomic_and_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar_nv'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_and_ushort_nv' mangled-name='atomic_and_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort_nv'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='bits'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_and_uint_nv' mangled-name='atomic_and_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint_nv'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_and_64_nv' mangled-name='atomic_and_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64_nv'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='bits'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='exp'/>
      <parameter type-id='type-id-55' name='des'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_cas_uchar' mangled-name='atomic_cas_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='exp'/>
      <parameter type-id='type-id-31' name='des'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='exp'/>
      <parameter type-id='type-id-33' name='des'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_cas_ushort' mangled-name='atomic_cas_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='exp'/>
      <parameter type-id='type-id-34' name='des'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='exp'/>
      <parameter type-id='type-id-50' name='des'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_cas_uint' mangled-name='atomic_cas_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='exp'/>
      <parameter type-id='type-id-36' name='des'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='exp'/>
      <parameter type-id='type-id-12' name='des'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_cas_64' mangled-name='atomic_cas_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='exp'/>
      <parameter type-id='type-id-37' name='des'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-4' name='exp'/>
      <parameter type-id='type-id-4' name='des'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-55' name='bits'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='atomic_swap_uchar' mangled-name='atomic_swap_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uchar'>
      <parameter type-id='type-id-47' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-49' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_swap_ushort' mangled-name='atomic_swap_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ushort'>
      <parameter type-id='type-id-63' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-52' name='target'/>
      <parameter type-id='type-id-50' name='bits'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='atomic_swap_uint' mangled-name='atomic_swap_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uint'>
      <parameter type-id='type-id-59' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_swap_64' mangled-name='atomic_swap_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_64'>
      <parameter type-id='type-id-54' name='target'/>
      <parameter type-id='type-id-37' name='bits'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-65' name='target'/>
      <parameter type-id='type-id-4' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-36' name='value'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-61' name='target'/>
      <parameter type-id='type-id-36' name='value'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='membar_exit' mangled-name='membar_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_exit'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-67'/>
    <typedef-decl name='int8_t' type-id='type-id-68' id='type-id-66'/>
    <typedef-decl name='uint32_t' type-id='type-id-69' id='type-id-50'/>
    <typedef-decl name='uint8_t' type-id='type-id-70' id='type-id-55'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-30'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-35'/>
    <typedef-decl name='__int8_t' type-id='type-id-67' id='type-id-68'/>
    <typedef-decl name='__uint32_t' type-id='type-id-35' id='type-id-69'/>
    <typedef-decl name='__uint8_t' type-id='type-id-30' id='type-id-70'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-71'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <typedef-decl name='list_t' type-id='type-id-72' id='type-id-73'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-75' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-74' id='type-id-76'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-78'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-11' name='size'/>
      <parameter type-id='type-id-11' name='offset'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <parameter type-id='type-id-4' name='nobject'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <parameter type-id='type-id-4' name='nobject'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-78' name='list'/>
      <parameter type-id='type-id-4' name='object'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-78' name='dst'/>
      <parameter type-id='type-id-78' name='src'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-77' name='lold'/>
      <parameter type-id='type-id-77' name='lnew'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-77' name='ln'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-77' name='ln'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-78' name='list'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='type-id-79' id='type-id-80'/>
    <typedef-decl name='__mode_t' type-id='type-id-32' id='type-id-79'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-7' name='d'/>
      <parameter type-id='type-id-80' name='mode'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-83'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/getexecname.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='sysctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-84'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/gethostid.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='gethostid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/getmntany.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='640' id='type-id-85'>
      <subrange length='10' type-id='type-id-24' id='type-id-86'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='8192' id='type-id-87'>
      <subrange length='1024' type-id='type-id-24' id='type-id-88'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-89'>
      <subrange length='16' type-id='type-id-24' id='type-id-90'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='640' id='type-id-91'>
      <subrange length='80' type-id='type-id-24' id='type-id-92'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-41' size-in-bits='64' id='type-id-93'>
      <subrange length='2' type-id='type-id-24' id='type-id-25'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='640' id='type-id-94'>
      <subrange length='10' type-id='type-id-24' id='type-id-86'/>
    </array-type-def>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1792' is-struct='yes' visibility='default' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='st_padding0' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='st_padding1' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_atim' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_mtim' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='st_ctim' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='st_birthtim' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='st_size' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='st_blocks' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='st_blksize' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='st_flags' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='st_gen' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='st_spare' type-id='type-id-85' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dev_t' type-id='type-id-107' id='type-id-97'/>
    <typedef-decl name='__dev_t' type-id='type-id-23' id='type-id-107'/>
    <typedef-decl name='ino_t' type-id='type-id-108' id='type-id-98'/>
    <typedef-decl name='__ino_t' type-id='type-id-23' id='type-id-108'/>
    <typedef-decl name='nlink_t' type-id='type-id-109' id='type-id-99'/>
    <typedef-decl name='__nlink_t' type-id='type-id-23' id='type-id-109'/>
    <typedef-decl name='uid_t' type-id='type-id-110' id='type-id-100'/>
    <typedef-decl name='__uid_t' type-id='type-id-69' id='type-id-110'/>
    <typedef-decl name='gid_t' type-id='type-id-111' id='type-id-101'/>
    <typedef-decl name='__gid_t' type-id='type-id-69' id='type-id-111'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-27' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-113' id='type-id-112'/>
    <typedef-decl name='__time_t' type-id='type-id-42' id='type-id-113'/>
    <typedef-decl name='off_t' type-id='type-id-114' id='type-id-103'/>
    <typedef-decl name='__off_t' type-id='type-id-42' id='type-id-114'/>
    <typedef-decl name='blkcnt_t' type-id='type-id-115' id='type-id-104'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-42' id='type-id-115'/>
    <typedef-decl name='blksize_t' type-id='type-id-116' id='type-id-105'/>
    <typedef-decl name='__blksize_t' type-id='type-id-40' id='type-id-116'/>
    <typedef-decl name='fflags_t' type-id='type-id-117' id='type-id-106'/>
    <typedef-decl name='__fflags_t' type-id='type-id-69' id='type-id-117'/>
    <class-decl name='statfs' size-in-bits='18752' is-struct='yes' visibility='default' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_version' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='f_type' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_flags' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_bsize' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_iosize' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_blocks' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_bfree' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_bavail' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_files' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_ffree' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_syncwrites' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_asyncwrites' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_syncreads' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_asyncreads' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_spare' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_namemax' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='f_owner' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_fsid' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='f_charspare' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='f_fstypename' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='f_mntfromname' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='f_mntonname' type-id='type-id-87' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fsid_t' type-id='type-id-120' id='type-id-119'/>
    <class-decl name='fsid' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-125'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-7' name='path'/>
      <parameter type-id='type-id-122' name='entry'/>
      <parameter type-id='type-id-124' name='statbuf'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='stat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='statfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='statfs2mnttab' mangled-name='statfs2mnttab' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statfs2mnttab'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/mnttab.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='1024' id='type-id-126'>
      <subrange length='128' type-id='type-id-24' id='type-id-127'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='8' id='type-id-128'>
      <subrange length='1' type-id='type-id-24' id='type-id-129'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='24' id='type-id-130'>
      <subrange length='3' type-id='type-id-24' id='type-id-131'/>
    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-132' id='type-id-133'/>
    <class-decl name='__sFILE' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_p' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_r' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_w' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_flags' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='_file' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_bf' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_lbfsize' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_cookie' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_close' type-id='type-id-136' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_read' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_seek' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_write' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_ub' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_up' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_ur' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_ubuf' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_nbuf' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_lb' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_blksize' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_fl_mutex' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_fl_owner' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_fl_count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='_orientation' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_mbstate' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__sbuf' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_size' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-114' id='type-id-140'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-144' id='type-id-143'/>
    <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' id='type-id-144'>
      <data-member access='private'>
        <var-decl name='__mbstate8' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_mbstateL' type-id='type-id-42' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-134'/>
    <function-decl name='hasmntopt' mangled-name='hasmntopt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hasmntopt'>
      <parameter type-id='type-id-123' name='mnt'/>
      <parameter type-id='type-id-71' name='opt'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-145' name='fd'/>
      <parameter type-id='type-id-123' name='mgetp'/>
      <parameter type-id='type-id-123' name='mrefp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getfsstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getmntent' mangled-name='getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent'>
      <parameter type-id='type-id-145' name='fp'/>
      <parameter type-id='type-id-123' name='mp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='lseek' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-140'/>
    </function-type>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-141'/>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-151'/>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-152'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/freebsd/zone.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-5' id='type-id-153'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='sysctlbyname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libspl' language='LANG_C99'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-160'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-36' name='timestamp_fmt'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libuutil' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-16'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-35'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-20'/>
    <type-decl name='variadic parameter type' id='type-id-161'/>
    <type-decl name='void' id='type-id-6'/>
    <typedef-decl name='size_t' type-id='type-id-19' id='type-id-11'/>
    <typedef-decl name='__size_t' type-id='type-id-23' id='type-id-19'/>
    <typedef-decl name='__uint64_t' type-id='type-id-20' id='type-id-23'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-13'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-4'/>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-11' name='n'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-4' name='p'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-7' name='str'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-7' name='s'/>
      <parameter type-id='type-id-11' name='n'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-4' name='buf'/>
      <parameter type-id='type-id-11' name='sz'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-7' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-71'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libuutil' language='LANG_C99'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-24'/>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='128' id='type-id-21'>
      <subrange length='2' type-id='type-id-24' id='type-id-25'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='512' id='type-id-162'>
      <subrange length='64' type-id='type-id-24' id='type-id-163'/>
    </array-type-def>
    <class-decl name='pthread_mutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-152'/>
    <class-decl name='pthread_mutex_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-164'/>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-67'/>
    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='192' id='type-id-165'>
      <subrange length='3' type-id='type-id-24' id='type-id-131'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-30'/>
    <class-decl name='uu_avl_pool' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='uap_null_avl' type-id='type-id-170' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-166' id='type-id-171'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-172' id='type-id-173'/>
    <typedef-decl name='uint8_t' type-id='type-id-70' id='type-id-55'/>
    <typedef-decl name='__uint8_t' type-id='type-id-30' id='type-id-70'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-141' id='type-id-169'/>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-175' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-26' id='type-id-22'/>
    <typedef-decl name='__uintptr_t' type-id='type-id-23' id='type-id-26'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ulong_t' type-id='type-id-20' id='type-id-12'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-55' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-176' id='type-id-175'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-174' id='type-id-170'/>
    <typedef-decl name='int8_t' type-id='type-id-68' id='type-id-66'/>
    <typedef-decl name='__int8_t' type-id='type-id-67' id='type-id-68'/>
    <typedef-decl name='uint32_t' type-id='type-id-69' id='type-id-50'/>
    <typedef-decl name='__uint32_t' type-id='type-id-35' id='type-id-69'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-179' id='type-id-180'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-165' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-18' id='type-id-181'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-22' id='type-id-182'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-185'/>
    <qualified-type-def type-id='type-id-185' const='yes' id='type-id-186'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-191'/>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-7' name='name'/>
      <parameter type-id='type-id-11' name='objsize'/>
      <parameter type-id='type-id-11' name='nodeoffset'/>
      <parameter type-id='type-id-168' name='compare_func'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-187'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-4' name='base'/>
      <parameter type-id='type-id-189' name='np'/>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-4' name='base'/>
      <parameter type-id='type-id-189' name='np'/>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-167' name='pp'/>
      <parameter type-id='type-id-4' name='parent'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-178' name='ap'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-178' name='ap'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-178' name='ap'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-178' name='ap'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-4' name='node'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-4' name='node'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-177' name='wp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-177' name='wp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-190' name='func'/>
      <parameter type-id='type-id-4' name='private'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-191' name='cookie'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-4' name='elem'/>
      <parameter type-id='type-id-4' name='private'/>
      <parameter type-id='type-id-188' name='out'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-4' name='elem'/>
      <parameter type-id='type-id-182' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-182' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-178' name='ap'/>
      <parameter type-id='type-id-182' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-18'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='128' id='type-id-192'>
      <subrange length='2' type-id='type-id-24' id='type-id-25'/>
    </array-type-def>
    <class-decl name='uu_list_pool' size-in-bits='1856' is-struct='yes' visibility='default' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ulp_null_list' type-id='type-id-195' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-193' id='type-id-196'/>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-199' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-200' id='type-id-198'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-201' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-205' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-202' id='type-id-199'/>
    <typedef-decl name='uu_list_t' type-id='type-id-197' id='type-id-195'/>
    <typedef-decl name='uu_list_node_t' type-id='type-id-206' id='type-id-207'/>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-192' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_index_t' type-id='type-id-22' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-203'/>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-7' name='name'/>
      <parameter type-id='type-id-11' name='objsize'/>
      <parameter type-id='type-id-11' name='nodeoffset'/>
      <parameter type-id='type-id-168' name='compare_func'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-194' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-4' name='base'/>
      <parameter type-id='type-id-210' name='np_arg'/>
      <parameter type-id='type-id-194' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-4' name='base'/>
      <parameter type-id='type-id-210' name='np_arg'/>
      <parameter type-id='type-id-194' name='pp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-194' name='pp'/>
      <parameter type-id='type-id-4' name='parent'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-204' name='lp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='elem'/>
      <parameter type-id='type-id-208' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='elem'/>
      <parameter type-id='type-id-4' name='private'/>
      <parameter type-id='type-id-209' name='out'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-208' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-208' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-203'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-203' name='wp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-203' name='wp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-190' name='func'/>
      <parameter type-id='type-id-4' name='private'/>
      <parameter type-id='type-id-50' name='flags'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-191' name='cookie'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-204' name='lp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='target'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='target'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-204' name='lp'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-204' name='lp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-204' name='lp'/>
      <parameter type-id='type-id-4' name='elem'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libuutil' language='LANG_C99'>
    <class-decl name='pthread' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-151'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <function-decl name='pthread_setspecific' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_key_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_error' mangled-name='uu_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='pthread_getspecific' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-50' name='code'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-142'/>
    </function-decl>
    <function-decl name='pause' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_atfork' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-211'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-213'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/media/svn/openzfs/forced_export/lib/libuutil' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <var-decl name='uu_exit_ok_value' type-id='type-id-5' mangled-name='uu_exit_ok_value' visibility='default' elf-symbol-id='uu_exit_ok_value'/>
    <var-decl name='uu_exit_fatal_value' type-id='type-id-5' mangled-name='uu_exit_fatal_value' visibility='default' elf-symbol-id='uu_exit_fatal_value'/>
    <var-decl name='uu_exit_usage_value' type-id='type-id-5' mangled-name='uu_exit_usage_value' visibility='default' elf-symbol-id='uu_exit_usage_value'/>
    <function-decl name='uu_exit_ok' mangled-name='uu_exit_ok' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_ok'>
      <return type-id='type-id-83'/>
    </function-decl>
    <function-decl name='uu_exit_fatal' mangled-name='uu_exit_fatal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_fatal'>
      <return type-id='type-id-83'/>
    </function-decl>
    <function-decl name='uu_exit_usage' mangled-name='uu_exit_usage' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_usage'>
      <return type-id='type-id-83'/>
    </function-decl>
    <function-decl name='uu_alt_exit' mangled-name='uu_alt_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_alt_exit'>
      <parameter type-id='type-id-5' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_vwarn' mangled-name='uu_vwarn' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vwarn'>
      <parameter type-id='type-id-7' name='format'/>
      <parameter type-id='type-id-216' name='alist'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_warn' mangled-name='uu_warn' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_warn'>
      <parameter type-id='type-id-7' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_vdie' mangled-name='uu_vdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vdie'>
      <parameter type-id='type-id-7' name='format'/>
      <parameter type-id='type-id-216' name='alist'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_die' mangled-name='uu_die' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_die'>
      <parameter type-id='type-id-7' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_vxdie' mangled-name='uu_vxdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vxdie'>
      <parameter type-id='type-id-5' name='status'/>
      <parameter type-id='type-id-7' name='format'/>
      <parameter type-id='type-id-216' name='alist'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_xdie' mangled-name='uu_xdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_xdie'>
      <parameter type-id='type-id-5' name='status'/>
      <parameter type-id='type-id-7' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_setpname' mangled-name='uu_setpname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_setpname'>
      <parameter type-id='type-id-71' name='arg0'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-7'/>
    </function-decl>
