<abi-corpus path='libuutil.so' architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_list_walk_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_list_walk_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_memdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/allan/zfsonlinux/lib/libavl' language='LANG_C89'>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-1' name='tree'/>
      <parameter type-id='type-id-2' name='new_data'/>
      <parameter type-id='type-id-2' name='here'/>
      <parameter type-id='type-id-3' name='direction'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-1' name='tree'/>
      <parameter type-id='type-id-2' name='new_node'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-1' name='t'/>
      <parameter type-id='type-id-2' name='obj'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-1' name='t'/>
      <parameter type-id='type-id-2' name='obj'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-1' name='t'/>
      <parameter type-id='type-id-2' name='obj'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-1' name='tree1'/>
      <parameter type-id='type-id-1' name='tree2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-1' name='tree'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <typedef-decl name='boolean_t' type-id='type-id-9' id='type-id-5'/>
    <type-decl name='void' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-9'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' id='type-id-7'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-15' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <typedef-decl name='size_t' type-id='type-id-19' id='type-id-15'/>
    <typedef-decl name='ulong_t' type-id='type-id-19' id='type-id-16'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-19' id='type-id-21'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-22'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <var-decl name='libspl_assert_ok' type-id='type-id-3' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <typedef-decl name='uchar_t' type-id='type-id-24' id='type-id-25'/>
    <typedef-decl name='uint16_t' type-id='type-id-26' id='type-id-27'/>
    <typedef-decl name='ushort_t' type-id='type-id-26' id='type-id-28'/>
    <typedef-decl name='uint64_t' type-id='type-id-19' id='type-id-29'/>
    <typedef-decl name='int16_t' type-id='type-id-30' id='type-id-31'/>
    <typedef-decl name='int32_t' type-id='type-id-3' id='type-id-32'/>
    <typedef-decl name='int64_t' type-id='type-id-33' id='type-id-34'/>
    <typedef-decl name='ssize_t' type-id='type-id-35' id='type-id-36'/>
    <typedef-decl name='__ssize_t' type-id='type-id-33' id='type-id-35'/>
    <qualified-type-def type-id='type-id-25' volatile='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-27' volatile='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <qualified-type-def type-id='type-id-41' volatile='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-29' volatile='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-46' volatile='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-49' volatile='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-16' volatile='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-28' volatile='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <qualified-type-def type-id='type-id-4' volatile='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar' mangled-name='atomic_inc_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-40' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort' mangled-name='atomic_inc_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-43' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_uint' mangled-name='atomic_inc_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_64' mangled-name='atomic_inc_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar' mangled-name='atomic_dec_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-40' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort' mangled-name='atomic_dec_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-43' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_uint' mangled-name='atomic_dec_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_dec_64' mangled-name='atomic_dec_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_char' mangled-name='atomic_add_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_short' mangled-name='atomic_add_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_int' mangled-name='atomic_add_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_64' mangled-name='atomic_add_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_char' mangled-name='atomic_sub_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_short' mangled-name='atomic_sub_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_int' mangled-name='atomic_sub_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_64' mangled-name='atomic_sub_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_uchar' mangled-name='atomic_or_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_ushort' mangled-name='atomic_or_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_uint' mangled-name='atomic_or_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_or_64' mangled-name='atomic_or_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_uchar' mangled-name='atomic_and_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_ushort' mangled-name='atomic_and_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_uint' mangled-name='atomic_and_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_and_64' mangled-name='atomic_and_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar_nv' mangled-name='atomic_inc_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort_nv' mangled-name='atomic_inc_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_inc_uint_nv' mangled-name='atomic_inc_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_inc_64_nv' mangled-name='atomic_inc_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar_nv' mangled-name='atomic_dec_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort_nv' mangled-name='atomic_dec_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_dec_uint_nv' mangled-name='atomic_dec_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_dec_64_nv' mangled-name='atomic_dec_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_add_char_nv' mangled-name='atomic_add_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_add_short_nv' mangled-name='atomic_add_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_add_int_nv' mangled-name='atomic_add_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_add_64_nv' mangled-name='atomic_add_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-58' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_sub_char_nv' mangled-name='atomic_sub_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-59' name='bits'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-31' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_sub_short_nv' mangled-name='atomic_sub_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_sub_int_nv' mangled-name='atomic_sub_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_sub_64_nv' mangled-name='atomic_sub_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-36' name='bits'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_or_uchar_nv' mangled-name='atomic_or_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_or_ushort_nv' mangled-name='atomic_or_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_or_uint_nv' mangled-name='atomic_or_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='bits'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_or_64_nv' mangled-name='atomic_or_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_and_uchar_nv' mangled-name='atomic_and_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar_nv'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_and_ushort_nv' mangled-name='atomic_and_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort_nv'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_and_uint_nv' mangled-name='atomic_and_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint_nv'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='bits'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_and_64_nv' mangled-name='atomic_and_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64_nv'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='exp'/>
      <parameter type-id='type-id-46' name='des'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_cas_uchar' mangled-name='atomic_cas_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='exp'/>
      <parameter type-id='type-id-25' name='des'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='exp'/>
      <parameter type-id='type-id-27' name='des'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_cas_ushort' mangled-name='atomic_cas_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='exp'/>
      <parameter type-id='type-id-28' name='des'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='exp'/>
      <parameter type-id='type-id-41' name='des'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_cas_uint' mangled-name='atomic_cas_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='exp'/>
      <parameter type-id='type-id-49' name='des'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='exp'/>
      <parameter type-id='type-id-16' name='des'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_cas_64' mangled-name='atomic_cas_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='exp'/>
      <parameter type-id='type-id-29' name='des'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-2' name='exp'/>
      <parameter type-id='type-id-2' name='des'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-48' name='target'/>
      <parameter type-id='type-id-46' name='bits'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='atomic_swap_uchar' mangled-name='atomic_swap_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uchar'>
      <parameter type-id='type-id-38' name='target'/>
      <parameter type-id='type-id-25' name='bits'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-40' name='target'/>
      <parameter type-id='type-id-27' name='bits'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_swap_ushort' mangled-name='atomic_swap_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ushort'>
      <parameter type-id='type-id-55' name='target'/>
      <parameter type-id='type-id-28' name='bits'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-43' name='target'/>
      <parameter type-id='type-id-41' name='bits'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='atomic_swap_uint' mangled-name='atomic_swap_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uint'>
      <parameter type-id='type-id-51' name='target'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-16' name='bits'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_swap_64' mangled-name='atomic_swap_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_64'>
      <parameter type-id='type-id-45' name='target'/>
      <parameter type-id='type-id-29' name='bits'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-57' name='target'/>
      <parameter type-id='type-id-2' name='bits'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-49' name='value'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-53' name='target'/>
      <parameter type-id='type-id-49' name='value'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='membar_exit' mangled-name='membar_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_exit'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-4'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-33'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-30'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-59'/>
    <typedef-decl name='int8_t' type-id='type-id-59' id='type-id-58'/>
    <typedef-decl name='uint32_t' type-id='type-id-60' id='type-id-41'/>
    <typedef-decl name='uint8_t' type-id='type-id-24' id='type-id-46'/>
    <typedef-decl name='uint_t' type-id='type-id-60' id='type-id-49'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-24'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-26'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-60'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <function-decl name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-61'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <typedef-decl name='list_t' type-id='type-id-62' id='type-id-63'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-65' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-68'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-15' name='size'/>
      <parameter type-id='type-id-15' name='offset'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <parameter type-id='type-id-2' name='nobject'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <parameter type-id='type-id-2' name='nobject'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-68' name='list'/>
      <parameter type-id='type-id-2' name='object'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-68' name='dst'/>
      <parameter type-id='type-id-68' name='src'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-67' name='lold'/>
      <parameter type-id='type-id-67' name='lnew'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-67' name='ln'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-67' name='ln'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-68' name='list'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <typedef-decl name='mode_t' type-id='type-id-69' id='type-id-70'/>
    <typedef-decl name='__mode_t' type-id='type-id-60' id='type-id-69'/>
    <typedef-decl name='wchar_t' type-id='type-id-3' id='type-id-71'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-74'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-6' name='d'/>
      <parameter type-id='type-id-70' name='mode'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__rawmemchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <function-decl name='readlink' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-36'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-76'/>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='strtoull' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='fscanf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-77'/>
    <typedef-decl name='FILE' type-id='type-id-79' id='type-id-78'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-86' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-80'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-83'>
      <subrange length='1' type-id='type-id-22' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-86'>
      <subrange length='20' type-id='type-id-22' id='type-id-90'/>
    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-33' id='type-id-85'/>
    <typedef-decl name='__off_t' type-id='type-id-33' id='type-id-82'/>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' id='type-id-87'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='192' id='type-id-92'>
      <subrange length='3' type-id='type-id-22' id='type-id-93'/>
    </array-type-def>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-61' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__unused' type-id='type-id-92' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-19' id='type-id-97'/>
    <typedef-decl name='__ino64_t' type-id='type-id-19' id='type-id-98'/>
    <typedef-decl name='__nlink_t' type-id='type-id-19' id='type-id-99'/>
    <typedef-decl name='__uid_t' type-id='type-id-60' id='type-id-100'/>
    <typedef-decl name='__gid_t' type-id='type-id-60' id='type-id-101'/>
    <typedef-decl name='__blksize_t' type-id='type-id-33' id='type-id-102'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-33' id='type-id-103'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-91' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-33' id='type-id-91'/>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-110'/>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-77' name='fp'/>
      <parameter type-id='type-id-109' name='mgetp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-77' name='fp'/>
      <parameter type-id='type-id-109' name='mgetp'/>
      <parameter type-id='type-id-109' name='mrefp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-6' name='path'/>
      <parameter type-id='type-id-107' name='entry'/>
      <parameter type-id='type-id-110' name='statbuf'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='feof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getmntent_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='__xstat64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='__time_t' type-id='type-id-33' id='type-id-105'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <typedef-decl name='zoneid_t' type-id='type-id-3' id='type-id-111'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-111'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-33'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-61' name='dst'/>
      <parameter type-id='type-id-6' name='src'/>
      <parameter type-id='type-id-15' name='dstsize'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/allan/zfsonlinux/lib/libspl' language='LANG_C89'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-105' id='type-id-113'/>
    <typedef-decl name='__time_t' type-id='type-id-33' id='type-id-105'/>
    <typedef-decl name='nl_item' type-id='type-id-3' id='type-id-114'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-115'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-120'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-49' name='timestamp_fmt'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='printf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-61'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/home/allan/zfsonlinux/lib/libuutil' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-60'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <type-decl name='variadic parameter type' id='type-id-122'/>
    <type-decl name='void' id='type-id-4'/>
    <typedef-decl name='size_t' type-id='type-id-19' id='type-id-15'/>
    <typedef-decl name='uint_t' type-id='type-id-60' id='type-id-49'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-61'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-2'/>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-15' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-2' name='p'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-6' name='str'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-6' name='s'/>
      <parameter type-id='type-id-15' name='n'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-2' name='buf'/>
      <parameter type-id='type-id-15' name='sz'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-6' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vsnprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/home/allan/zfsonlinux/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='320' id='type-id-124'>
      <subrange length='40' type-id='type-id-22' id='type-id-125'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='32' id='type-id-126'>
      <subrange length='4' type-id='type-id-22' id='type-id-127'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='512' id='type-id-128'>
      <subrange length='64' type-id='type-id-22' id='type-id-129'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-33'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-30'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-59'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-22'/>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='192' id='type-id-130'>
      <subrange length='3' type-id='type-id-22' id='type-id-93'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-24'/>
    <class-decl name='uu_avl_pool' size-in-bits='2176' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='uap_null_avl' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-131' id='type-id-136'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-137' id='type-id-138'/>
    <typedef-decl name='uint8_t' type-id='type-id-24' id='type-id-46'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-139' id='type-id-134'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-139'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-33' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-141' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-142' id='type-id-141'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-145' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-19' id='type-id-21'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-15' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ulong_t' type-id='type-id-19' id='type-id-16'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-148' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-46' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-146' id='type-id-145'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-144' id='type-id-135'/>
    <typedef-decl name='int8_t' type-id='type-id-59' id='type-id-58'/>
    <typedef-decl name='uint32_t' type-id='type-id-60' id='type-id-41'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-149' id='type-id-150'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-130' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-18' id='type-id-151'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-21' id='type-id-152'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' id='type-id-7'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-153' id='type-id-154'/>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-153'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-3' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-21' id='type-id-155'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-1'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-164'/>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-15' name='objsize'/>
      <parameter type-id='type-id-15' name='nodeoffset'/>
      <parameter type-id='type-id-133' name='compare_func'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-132' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-2' name='base'/>
      <parameter type-id='type-id-162' name='np'/>
      <parameter type-id='type-id-132' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-2' name='base'/>
      <parameter type-id='type-id-162' name='np'/>
      <parameter type-id='type-id-132' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-132' name='pp'/>
      <parameter type-id='type-id-2' name='parent'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-148' name='ap'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-148' name='ap'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-148' name='ap'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-148' name='ap'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-2' name='node'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-2' name='node'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-147'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-147' name='wp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-147' name='wp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-163' name='func'/>
      <parameter type-id='type-id-2' name='private'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-164' name='cookie'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-2' name='elem'/>
      <parameter type-id='type-id-2' name='private'/>
      <parameter type-id='type-id-161' name='out'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-2' name='elem'/>
      <parameter type-id='type-id-152' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-152' name='idx'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-148' name='ap'/>
      <parameter type-id='type-id-152' name='idx'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-18'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/home/allan/zfsonlinux/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-165'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <class-decl name='uu_list_pool' size-in-bits='2112' is-struct='yes' visibility='default' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ulp_null_list' type-id='type-id-168' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-166' id='type-id-169'/>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-172' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-173' id='type-id-171'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-174' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-178' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-175' id='type-id-172'/>
    <typedef-decl name='uu_list_t' type-id='type-id-170' id='type-id-168'/>
    <typedef-decl name='uu_list_node_t' type-id='type-id-179' id='type-id-180'/>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-165' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_index_t' type-id='type-id-21' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-176'/>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-15' name='objsize'/>
      <parameter type-id='type-id-15' name='nodeoffset'/>
      <parameter type-id='type-id-133' name='compare_func'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-2' name='base'/>
      <parameter type-id='type-id-183' name='np_arg'/>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-2' name='base'/>
      <parameter type-id='type-id-183' name='np_arg'/>
      <parameter type-id='type-id-167' name='pp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-167' name='pp'/>
      <parameter type-id='type-id-2' name='parent'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-177' name='lp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='elem'/>
      <parameter type-id='type-id-181' name='idx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='elem'/>
      <parameter type-id='type-id-2' name='private'/>
      <parameter type-id='type-id-182' name='out'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-181' name='idx'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-181' name='idx'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-176'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-176' name='wp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-176' name='wp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-163' name='func'/>
      <parameter type-id='type-id-2' name='private'/>
      <parameter type-id='type-id-41' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='target'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='target'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-177' name='lp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-177' name='lp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-164' name='cookie'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-177' name='lp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-177' name='lp'/>
      <parameter type-id='type-id-2' name='elem'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/home/allan/zfsonlinux/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-83'>
      <subrange length='1' type-id='type-id-22' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-86'>
      <subrange length='20' type-id='type-id-22' id='type-id-90'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-26'/>
    <typedef-decl name='pthread_key_t' type-id='type-id-60' id='type-id-184'/>
    <typedef-decl name='pthread_t' type-id='type-id-19' id='type-id-185'/>
    <typedef-decl name='FILE' type-id='type-id-79' id='type-id-78'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-86' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-33' id='type-id-82'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' id='type-id-87'/>
    <typedef-decl name='__off64_t' type-id='type-id-33' id='type-id-85'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <function-decl name='uu_error' mangled-name='uu_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-41' name='code'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_setspecific' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_key_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_getspecific' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-185'/>
    </function-decl>
    <function-decl name='vfprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pause' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_atfork' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-188'>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/home/allan/zfsonlinux/lib/libuutil' language='LANG_C89'>
